# Staging Apply
```
ENV=staging ./scripts/infra plan \-var "gfw_api_token=gfw_api_token" \
                        -var "slack_data_updates_hook=slack_hook" \
                        -var "rds_password=password" \
                        -var "rds_password_ro=password" \
                        -var "gfw-gee-export_key=gee_export_key" \
                        -var "planet_api_key=planet_api_key" \
                        -var "jterry_ip=192.168.1.10" \
                        -var "dmannarino_ip=192.168.1.11" \
                        -var "snegusse_ip=192.168.1.12" \
                        -var "gtempus_ip=192.168.1.13" \
                        -var "office_3sc_ip=192.168.1.14" \
                        -var "vpn_3sc_ip=192.168.1.15"
```
result:
```
/usr/local/src/terraform /usr/local/src
Using environment staging and AWS_PROFILE gfw-staging
Starting terraform plan...
Terraform plan - Running pre-plan init
Initializing modules...
Downloading git::https://github.com/wri/gfw-terraform-modules.git?ref=v0.4.0 for api_token_secret...
- api_token_secret in .terraform/modules/api_token_secret/terraform/modules/secrets
- bootstrap in modules/bootstrap
Downloading git::https://github.com/wri/gfw-terraform-modules.git?ref=v0.4.0 for data-lake-test-bucket...
- data-lake-test-bucket in .terraform/modules/data-lake-test-bucket/terraform/modules/storage
Downloading git::https://github.com/cloudposse/terraform-aws-iam-policy-document-aggregator.git?ref=0.6.0 for data-lake-test-bucket.bucket_policy...
- data-lake-test-bucket.bucket_policy in .terraform/modules/data-lake-test-bucket.bucket_policy
Downloading git::https://github.com/wri/gfw-terraform-modules.git?ref=v0.4.0 for data-lake_bucket...
- data-lake_bucket in .terraform/modules/data-lake_bucket/terraform/modules/storage
Downloading git::https://github.com/cloudposse/terraform-aws-iam-policy-document-aggregator.git?ref=0.6.0 for data-lake_bucket.bucket_policy...
- data-lake_bucket.bucket_policy in .terraform/modules/data-lake_bucket.bucket_policy
- documentdb in modules/document_db
- firewall in modules/firewall
Downloading git::https://github.com/wri/gfw-terraform-modules.git?ref=v0.4.0 for gcs_gfw_gee_export_secret...
- gcs_gfw_gee_export_secret in .terraform/modules/gcs_gfw_gee_export_secret/terraform/modules/secrets
Downloading git::https://github.com/wri/gfw-terraform-modules.git?ref=v0.4.0 for pipeline-test-bucket...
- pipeline-test-bucket in .terraform/modules/pipeline-test-bucket/terraform/modules/storage
Downloading git::https://github.com/cloudposse/terraform-aws-iam-policy-document-aggregator.git?ref=0.6.0 for pipeline-test-bucket.bucket_policy...
- pipeline-test-bucket.bucket_policy in .terraform/modules/pipeline-test-bucket.bucket_policy
Downloading git::https://github.com/wri/gfw-terraform-modules.git?ref=v0.4.0 for pipeline_bucket...
- pipeline_bucket in .terraform/modules/pipeline_bucket/terraform/modules/storage
Downloading git::https://github.com/cloudposse/terraform-aws-iam-policy-document-aggregator.git?ref=0.6.0 for pipeline_bucket.bucket_policy...
- pipeline_bucket.bucket_policy in .terraform/modules/pipeline_bucket.bucket_policy
Downloading git::https://github.com/wri/gfw-terraform-modules.git?ref=v0.4.0 for planet_api_key_secret...
- planet_api_key_secret in .terraform/modules/planet_api_key_secret/terraform/modules/secrets
- postgresql in modules/postgresql
Downloading git::https://github.com/wri/gfw-terraform-modules.git?ref=v0.4.0 for postgresql.read_only_secret...
- postgresql.read_only_secret in .terraform/modules/postgresql.read_only_secret/terraform/modules/secrets
Downloading git::https://github.com/wri/gfw-terraform-modules.git?ref=v0.4.0 for postgresql.write_secret...
- postgresql.write_secret in .terraform/modules/postgresql.write_secret/terraform/modules/secrets
- redis in modules/elastic_cache
Downloading git::https://github.com/wri/gfw-terraform-modules.git?ref=v0.4.0 for slack_secret...
- slack_secret in .terraform/modules/slack_secret/terraform/modules/secrets
- sns in modules/sns
- vpc in modules/vpc

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding latest version of hashicorp/template...
- Finding latest version of hashicorp/random...
- Finding hashicorp/aws versions matching ">= 2.56.*, < 4.0.*, >= 2.23.*, >= 2.23.*, >= 2.23.*, >= 2.23.*"...
- Finding latest version of hashicorp/local...
- Installing hashicorp/aws v3.75.2...
- Installed hashicorp/aws v3.75.2 (self-signed, key ID 34365D9472D7468F)
- Installing hashicorp/local v2.2.3...
- Installed hashicorp/local v2.2.3 (self-signed, key ID 34365D9472D7468F)
- Installing hashicorp/template v2.2.0...
- Installed hashicorp/template v2.2.0 (self-signed, key ID 34365D9472D7468F)
- Installing hashicorp/random v3.3.2...
- Installed hashicorp/random v3.3.2 (self-signed, key ID 34365D9472D7468F)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/plugins/signing.html

The following providers do not have any version constraints in configuration,
so the latest version was installed.

To prevent automatic upgrades to new major versions that may contain breaking
changes, we recommend adding version constraints in a required_providers block
in your configuration, with the constraint strings suggested below.

* hashicorp/local: version = "~> 2.2.3"
* hashicorp/random: version = "~> 3.3.2"
* hashicorp/template: version = "~> 2.2.0"


Warning: Interpolation-only expressions are deprecated

  on modules/vpc/main.tf line 184, in resource "aws_instance" "bastion":
 184:   iam_instance_profile = "${aws_iam_instance_profile.bastion_profile.name}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

(and 2 more similar warnings elsewhere)

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
Target branch set to default
Setting workspace to 'default'
Terraform plan - Running plan
Acquiring state lock. This may take a few moments...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.local_file.emr_default_policy: Refreshing state... [id=55cc21960556725876443839bc59e16c5cf9daac]
data.local_file.emr_ec2_default_policy: Refreshing state... [id=c28715fa5a30f33421bc825b1cf093f024d60830]
data.template_file.trust_emr: Refreshing state... [id=997e6c22ad0ce76ab049cc0bc6632e4f0d83c60f322271bb8486bd7b76e86d75]
data.template_file.trust_ec2: Refreshing state... [id=56c9af9e862a4f62a1098fd8d3c2d1c525868dfae5adfbe149516d2477e4af44]
module.postgresql.data.template_file.rds_enhanced_monitoring: Refreshing state... [id=536fdefdba4fce823a04ce0887eeb30e0da19cbd6c5e3abfa66771c7467fc833]
module.documentdb.random_password.documentdb_superuser: Refreshing state... [id=none]
module.pipeline_bucket.module.bucket_policy.data.aws_iam_policy_document.empty: Refreshing state... [id=561002259]
module.data-lake_bucket.module.bucket_policy.data.aws_iam_policy_document.empty: Refreshing state... [id=561002259]
aws_eip.apigw: Refreshing state... [id=eipalloc-031415c612faebf6f]
module.slack_secret.aws_secretsmanager_secret.default: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:274931322839:secret:slack/gfw-sync-X9BR6e]
module.postgresql.module.read_only_secret.aws_secretsmanager_secret.default: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:274931322839:secret:postgresql/read-only-YjhDOP]
module.vpc.aws_eip.bastion: Refreshing state... [id=eipalloc-0d07b99cd21765367]
module.documentdb.aws_secretsmanager_secret.documentdb: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:274931322839:secret:core-documentdb-secret-FNmEgH]
aws_iam_role.iam_emr_service_role: Refreshing state... [id=core-iam_emr_service_role]
module.bootstrap.aws_s3_bucket.state_bucket: Refreshing state... [id=gfw-terraform-staging]
module.postgresql.aws_iam_role.rds_enhanced_monitoring: Refreshing state... [id=core-rds_enhanced_monitoring-role]
module.planet_api_key_secret.aws_secretsmanager_secret.default: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:274931322839:secret:planet/api_key-HHudQO]
module.vpc.aws_vpc.default: Refreshing state... [id=vpc-02462c9afbb7ac6fb]
data.aws_ami.amazon_linux_ami: Refreshing state... [id=ami-00db75007d6c5c578]
module.gcs_gfw_gee_export_secret.aws_secretsmanager_secret.default: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:274931322839:secret:gcs/gfw-gee-export-oOA3sc]
aws_iam_service_linked_role.spot: Refreshing state... [id=arn:aws:iam::274931322839:role/aws-service-role/spot.amazonaws.com/AWSServiceRoleForEC2Spot]
module.api_token_secret.aws_secretsmanager_secret.default: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:274931322839:secret:gfw-api/token-T2H6Cl]
module.data-lake_bucket.aws_s3_bucket.default: Refreshing state... [id=gfw-data-lake-staging]
aws_key_pair.all["lpopov_3sc"]: Refreshing state... [id=lpopov_3sc]
aws_key_pair.all["emartin_3sc"]: Refreshing state... [id=emartin_3sc]
module.bootstrap.aws_dynamodb_table.tf_lock_state: Refreshing state... [id=aws-locks]
aws_key_pair.all["oevans_3sc"]: Refreshing state... [id=oevans_3sc]
aws_key_pair.all["ipopov_3sc"]: Refreshing state... [id=ipopov_3sc]
aws_key_pair.all["gcrosby2_3sc"]: Refreshing state... [id=gcrosby2_3sc]
aws_key_pair.all["tyeadon_3sc"]: Refreshing state... [id=tyeadon_3sc]
aws_key_pair.all["tmaschler_gfw"]: Refreshing state... [id=tmaschler_gfw]
aws_key_pair.all["gcrosby_3sc"]: Refreshing state... [id=gcrosby_3sc]
aws_key_pair.all["dmannarino_gfw"]: Refreshing state... [id=dmannarino_gfw]
aws_key_pair.all["jterry_gfw"]: Refreshing state... [id=jterry_gfw]
aws_key_pair.all["snegusse_gfw"]: Refreshing state... [id=snegusse_gfw]
module.vpc.aws_iam_role.bastion_role: Refreshing state... [id=bastion_role]
module.documentdb.aws_docdb_cluster_parameter_group.default: Refreshing state... [id=core-documentdb-parameter-group]
module.pipeline_bucket.aws_s3_bucket.default: Refreshing state... [id=gfw-pipelines-staging]
module.redis.aws_elasticache_parameter_group.default: Refreshing state... [id=core-redis-params]
aws_iam_role.iam_emr_profile_role: Refreshing state... [id=core-emr_profile]
module.postgresql.module.write_secret.aws_secretsmanager_secret.default: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:274931322839:secret:postgresql/write-FhQF3j]
module.vpc.data.aws_ami.amazon_linux_ami: Refreshing state... [id=ami-00db75007d6c5c578]
module.sns.aws_iam_group.sns_discovery_publishers_group: Refreshing state... [id=data_discovery_publishers]
aws_acm_certificate.globalforestwatch[0]: Refreshing state... [id=arn:aws:acm:us-east-1:274931322839:certificate/67f5fed2-a8f0-46cd-a892-25c27c1f3552]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-064432e5ee7776150]
aws_cloudwatch_log_group.batch_job: Refreshing state... [id=/aws/batch/job]
module.sns.aws_sns_topic.data_discovery_topic: Refreshing state... [id=arn:aws:sns:us-east-1:274931322839:dataset-discovery]
module.documentdb.data.template_file.secrets_documentdb: Refreshing state... [id=935c4ace3a6f1b3e2267bde80d21cc97dc68f59de0aae07175bda9a7bc11f349]
module.slack_secret.aws_secretsmanager_secret_version.default: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:274931322839:secret:slack/gfw-sync-X9BR6e|1DD087EA-0951-457F-916F-5801D91ACF29]
module.planet_api_key_secret.data.template_file.default: Refreshing state... [id=98985677b6c615c90329828146a568299f02ae5f8972b4e03d6a79228a1eaab9]
module.planet_api_key_secret.aws_secretsmanager_secret_version.default: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:274931322839:secret:planet/api_key-HHudQO|7C8B4C11-B3C3-4173-8BDB-48C6E89CEE58]
module.postgresql.module.read_only_secret.data.template_file.default: Refreshing state... [id=9cc336b3d5467ab549c3a0e6625168917e16b6713301da8816cc88ed4bc0b3f7]
module.slack_secret.data.template_file.default: Refreshing state... [id=4c09acfd232d238bbd10f6af9ba8dd253a29fbad63dd91fd90ec33ba694daebb]
module.gcs_gfw_gee_export_secret.aws_secretsmanager_secret_version.default: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:274931322839:secret:gcs/gfw-gee-export-oOA3sc|5F1DF043-30C1-43F7-B0B1-7F62A6CA2709]
module.gcs_gfw_gee_export_secret.data.template_file.default: Refreshing state... [id=3c952e49e2f8a2bea6cdbd9286f7c8f72497e7c88d4c99423a7797cca59301e1]
module.api_token_secret.aws_secretsmanager_secret_version.default: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:274931322839:secret:gfw-api/token-T2H6Cl|52A9A6A4-FD2B-4C21-BE05-BE9F02AB4DC7]
module.api_token_secret.data.template_file.default: Refreshing state... [id=eca34213743b47af89814e0865f17f554ab720e292d331659993ba640083c2a1]
module.postgresql.aws_iam_role_policy_attachment.rds_enhanced_monitoring: Refreshing state... [id=core-rds_enhanced_monitoring-role-20200507024306210000000001]
aws_iam_role_policy.iam_emr_service_policy: Refreshing state... [id=core-iam_emr_service_role:core-iam_emr_service_policy]
data.template_file.apigw_setup: Refreshing state... [id=006a91338b3ed741d68b84e01888301f89505538f9a52cd4868bbed337dc049f]
module.vpc.aws_internet_gateway.default: Refreshing state... [id=igw-00c8de947dc445bec]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0c6313b7687bffe32]
module.vpc.aws_subnet.public[3]: Refreshing state... [id=subnet-01acf762b03b2895c]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-09b61083f3c293880]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-08470b7b1a4d028c9]
module.vpc.aws_subnet.public[4]: Refreshing state... [id=subnet-0c76d84ec6bd9b6fa]
module.vpc.aws_subnet.public[5]: Refreshing state... [id=subnet-02fd6beb7cbd626c7]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0d23d9a922a378b8a]
module.vpc.aws_route_table.private[4]: Refreshing state... [id=rtb-049789a3baeedda72]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-0f8ae8565e7c7adb8]
module.vpc.aws_route_table.private[5]: Refreshing state... [id=rtb-0383e5adc37ea1fba]
module.vpc.aws_route_table.private[3]: Refreshing state... [id=rtb-0b280a863c865b3ef]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0b04555685bc3b2c3]
module.vpc.aws_subnet.private[5]: Refreshing state... [id=subnet-0e5cbee1cf6ef2478]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-04ddc9045d5fd0f4b]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-02af729fdecf56dea]
module.vpc.aws_subnet.private[4]: Refreshing state... [id=subnet-08d4d18b5ff791b9b]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-06e6df2fd5d54b785]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0826505d1c80184f6]
module.vpc.aws_subnet.private[3]: Refreshing state... [id=subnet-06ad6d752f5eb9ccd]
module.postgresql.module.write_secret.data.template_file.default: Refreshing state... [id=7de3a69108bb7803dc66f636b9b7e46b7e30825fb54933c6007d27915630d5b6]
module.vpc.aws_iam_instance_profile.bastion_profile: Refreshing state... [id=bastion_profile]
module.vpc.aws_iam_role_policy.test_policy: Refreshing state... [id=bastion_role:test_policy]
module.documentdb.aws_iam_policy.secrets_documentdb: Refreshing state... [id=arn:aws:iam::274931322839:policy/core-secrets_documentdb]
aws_iam_instance_profile.emr_profile: Refreshing state... [id=core-emr_profile]
aws_iam_role_policy.iam_emr_profile_policy: Refreshing state... [id=core-emr_profile:core-iam_emr_profile_policy]
module.postgresql.module.read_only_secret.aws_iam_policy.default: Refreshing state... [id=arn:aws:iam::274931322839:policy/core-read-secret-postgresql-read-only]
module.planet_api_key_secret.aws_iam_policy.default: Refreshing state... [id=arn:aws:iam::274931322839:policy/core-read-secret-planet-api_key]
module.slack_secret.aws_iam_policy.default: Refreshing state... [id=arn:aws:iam::274931322839:policy/core-read-secret-slack-gfw-sync]
module.gcs_gfw_gee_export_secret.aws_iam_policy.default: Refreshing state... [id=arn:aws:iam::274931322839:policy/core-read-secret-gcs-gfw-gee-export]
module.api_token_secret.aws_iam_policy.default: Refreshing state... [id=arn:aws:iam::274931322839:policy/core-read-secret-gfw-api-token]
module.sns.data.aws_iam_policy_document.partner_sns_publish_policy_doc: Refreshing state... [id=2666507029]
module.vpc.data.template_file.bastion_setup: Refreshing state... [id=006a91338b3ed741d68b84e01888301f89505538f9a52cd4868bbed337dc049f]
aws_security_group.apigw: Refreshing state... [id=sg-08b8b35b8686cbc51]
module.vpc.aws_nat_gateway.default[0]: Refreshing state... [id=nat-0302ff06f05360859]
module.data-lake_bucket.data.template_file.read_access_role_bucket_policy[1]: Refreshing state... [id=ef87cc18cafcd6c6b76a1033f21758670624ee0fd15821a74309bca247cc2117]
module.data-lake_bucket.data.template_file.read_access_role_bucket_policy[0]: Refreshing state... [id=0cf641294e9394ec84f1bb8f7bd69d99c12f5be8a8440d1bb823eec22e7697bb]
module.data-lake_bucket.data.template_file.write_access[0]: Refreshing state... [id=82ba629d79342c83adcdfba4a52446e2376676b493d3ed0bd971b303e4caf445]
module.data-lake_bucket.data.template_file.write_access[1]: Refreshing state... [id=5660e0596be918107c8a6e57fd6260ffcef1ace7d91e042df7ba27bc550a01fe]
module.postgresql.module.write_secret.aws_iam_policy.default: Refreshing state... [id=arn:aws:iam::274931322839:policy/core-read-secret-postgresql-write]
module.vpc.aws_route.public: Refreshing state... [id=r-rtb-04ddc9045d5fd0f4b1080289494]
module.vpc.aws_vpc_endpoint.s3: Refreshing state... [id=vpce-0b9167bcf44e83838]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-085cf5418b55e45d8]
module.vpc.aws_route_table_association.public[4]: Refreshing state... [id=rtbassoc-0b317bf738e4f8489]
module.vpc.aws_route_table_association.public[3]: Refreshing state... [id=rtbassoc-0807f8311f42ed92d]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-00d624d94955e839e]
module.vpc.aws_route_table_association.public[5]: Refreshing state... [id=rtbassoc-08967cf43fe51061d]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0b5926e3a7f06ae36]
module.vpc.aws_route_table_association.private[4]: Refreshing state... [id=rtbassoc-07be76272c72ec7e6]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0795ff5f2fd4e0e43]
module.vpc.aws_route_table_association.private[3]: Refreshing state... [id=rtbassoc-045875ae43bcfaf28]
module.vpc.aws_route_table_association.private[5]: Refreshing state... [id=rtbassoc-04b6f16ae98a876cd]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-072ee6d3dab7e5cf8]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0d0456ab545dd9698]
module.sns.aws_iam_policy.policy: Refreshing state... [id=arn:aws:iam::274931322839:policy/partner_sns_publish_policy]
module.redis.aws_security_group.default: Refreshing state... [id=sg-0e7994468d8ebd53b]
module.firewall.aws_security_group.webserver: Refreshing state... [id=sg-08cc4c9d2e95bc47b]
module.firewall.aws_security_group.default: Refreshing state... [id=sg-065df0427c77571bb]
module.documentdb.aws_security_group.documentdb: Refreshing state... [id=sg-064646fdcb5920f30]
module.postgresql.aws_security_group.postgresql: Refreshing state... [id=sg-0eac0da129448b72e]
module.data-lake_bucket.aws_iam_policy.s3_write_pipelines[1]: Refreshing state... [id=arn:aws:iam::274931322839:policy/core-s3_write_gfw-data-lake-staging_1]
module.data-lake_bucket.aws_iam_policy.s3_write_pipelines[0]: Refreshing state... [id=arn:aws:iam::274931322839:policy/core-s3_write_gfw-data-lake-staging_0]
module.vpc.aws_route.private[1]: Refreshing state... [id=r-rtb-0b04555685bc3b2c31080289494]
module.vpc.aws_route.private[4]: Refreshing state... [id=r-rtb-049789a3baeedda721080289494]
module.vpc.aws_route.private[2]: Refreshing state... [id=r-rtb-0f8ae8565e7c7adb81080289494]
module.vpc.aws_route.private[3]: Refreshing state... [id=r-rtb-0b280a863c865b3ef1080289494]
module.vpc.aws_route.private[5]: Refreshing state... [id=r-rtb-0383e5adc37ea1fba1080289494]
module.vpc.aws_route.private[0]: Refreshing state... [id=r-rtb-0d23d9a922a378b8a1080289494]
aws_security_group_rule.apigw_https_ingress: Refreshing state... [id=sgrule-868961119]
aws_security_group_rule.apigw_http_ingress: Refreshing state... [id=sgrule-544261372]
module.pipeline_bucket.data.template_file.public_folders_bucket_policy[1]: Refreshing state... [id=c6d4d0a160bc07ecbe4d33a5696949b30ac3d0eb6be0b4caa2d63920e096ffe1]
module.pipeline_bucket.data.template_file.public_folders_bucket_policy[3]: Refreshing state... [id=f68f9b395c50add902e9a8cc2d1e172ff737450514f7595b9f22197c3f91da8b]
module.pipeline_bucket.data.template_file.public_folders_bucket_policy[0]: Refreshing state... [id=fd633f5e8545ac6f490e99cf0f6ed0359d9e9e0273ad38f500ac3221495bf79d]
module.pipeline_bucket.data.template_file.public_folders_bucket_policy[2]: Refreshing state... [id=a0bc10380ef40ca3a0a33c20fcad8a7ee1e0cdf654f6d7c152f38f17f7e95b48]
module.pipeline_bucket.data.template_file.write_access[0]: Refreshing state... [id=9b6ffc0c4a2c2e1eb82fccbc29a9e8e408c6696074bc33569886b4d2a35e3718]
module.firewall.aws_security_group_rule.webserver_https_ingress: Refreshing state... [id=sgrule-890609762]
module.firewall.aws_security_group_rule.webserver_http_ingress: Refreshing state... [id=sgrule-1730002464]
module.redis.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-3718792523]
module.redis.aws_security_group_rule.egress: Refreshing state... [id=sgrule-110667067]
module.postgresql.aws_security_group_rule.postgresql_ingress: Refreshing state... [id=sgrule-3975589944]
module.postgresql.aws_security_group_rule.postgresql_egress: Refreshing state... [id=sgrule-1238397171]
module.firewall.aws_security_group_rule.default_https_egress: Refreshing state... [id=sgrule-1573091078]
module.firewall.aws_security_group_rule.default_ssh_egress: Refreshing state... [id=sgrule-4076944604]
module.firewall.aws_security_group_rule.ingress_ssh[5]: Refreshing state... [id=sgrule-3782876537]
module.firewall.aws_security_group_rule.default_http_egress: Refreshing state... [id=sgrule-768621610]
module.firewall.aws_security_group_rule.ingress_ssh[1]: Refreshing state... [id=sgrule-669891328]
module.firewall.aws_security_group_rule.ingress_ssh[6]: Refreshing state... [id=sgrule-1785616963]
module.firewall.aws_security_group_rule.ingress_ssh[2]: Refreshing state... [id=sgrule-949562368]
module.firewall.aws_security_group_rule.ingress_ssh[0]: Refreshing state... [id=sgrule-480000592]
module.firewall.aws_security_group_rule.ingress_ssh[9]: Refreshing state... [id=sgrule-2082921912]
module.firewall.aws_security_group_rule.ingress_ssh[4]: Refreshing state... [id=sgrule-341043819]
module.firewall.aws_security_group_rule.ingress_ssh[3]: Refreshing state... [id=sgrule-2150105693]
module.firewall.aws_security_group_rule.ingress_ssh[8]: Refreshing state... [id=sgrule-1993042425]
module.firewall.aws_security_group_rule.ingress_ssh[7]: Refreshing state... [id=sgrule-2217496740]
module.sns.aws_iam_group_policy_attachment.attachment: Refreshing state... [id=data_discovery_publishers-20210428144351211900000001]
module.documentdb.aws_security_group_rule.documentdb_egress: Refreshing state... [id=sgrule-2511625516]
module.documentdb.aws_security_group_rule.documentdb_ingress: Refreshing state... [id=sgrule-717314509]
module.redis.aws_elasticache_subnet_group.default: Refreshing state... [id=core-redis-cluster]
module.documentdb.aws_docdb_subnet_group.default: Refreshing state... [id=core-documentdb-subnet_group]
module.postgresql.aws_db_subnet_group.default: Refreshing state... [id=main]
module.pipeline_bucket.aws_iam_policy.s3_write_pipelines[0]: Refreshing state... [id=arn:aws:iam::274931322839:policy/core-s3_write_gfw-pipelines-staging_0]
aws_instance.apigw: Refreshing state... [id=i-0f188dd59d7539b20]
module.vpc.aws_instance.bastion: Refreshing state... [id=i-053c9d6fac48cfc3c]
module.data-lake_bucket.aws_s3_bucket_policy.default[0]: Refreshing state... [id=gfw-data-lake-staging]
module.pipeline_bucket.aws_s3_bucket_policy.default[0]: Refreshing state... [id=gfw-pipelines-staging]
module.redis.aws_elasticache_replication_group.default: Refreshing state... [id=core-redis-cluster]
module.documentdb.aws_docdb_cluster.default: Refreshing state... [id=core-documentdb-cluster]
module.postgresql.aws_rds_cluster.aurora_cluster: Refreshing state... [id=gfw-aurora]
module.documentdb.aws_secretsmanager_secret_version.documentdb: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:274931322839:secret:core-documentdb-secret-FNmEgH|A871E1DB-B70C-4E17-A47C-8845BA38F288]
module.documentdb.aws_cloudwatch_log_group.default[0]: Refreshing state... [id=/aws/rds/cluster/core-documentdb-cluster/audit]
module.documentdb.aws_cloudwatch_log_group.default[1]: Refreshing state... [id=/aws/rds/cluster/core-documentdb-cluster/profiler]
module.documentdb.aws_docdb_cluster_instance.default[0]: Refreshing state... [id=core-documentdb-instance-0]
module.postgresql.aws_appautoscaling_target.replicas: Refreshing state... [id=cluster:gfw-aurora]
module.postgresql.aws_cloudwatch_log_group.postgresql: Refreshing state... [id=/aws/rds/cluster/gfw-aurora/postgresql]
module.postgresql.aws_rds_cluster_instance.aurora_cluster_instance[0]: Refreshing state... [id=core-aurora-instance-0]
module.postgresql.module.read_only_secret.aws_secretsmanager_secret_version.default: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:274931322839:secret:postgresql/read-only-YjhDOP|98FE82B7-5A97-494C-A023-890294769C54]
module.postgresql.module.write_secret.aws_secretsmanager_secret_version.default: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:274931322839:secret:postgresql/write-FhQF3j|6668BCE5-881D-41DF-94E9-739902225C4C]
module.postgresql.aws_appautoscaling_policy.replicas: Refreshing state... [id=cpu-auto-scaling]
aws_eip_association.eip_assoc: Refreshing state... [id=eipassoc-042efffeb1e2cd979]
module.vpc.aws_eip_association.eip_assoc: Refreshing state... [id=eipassoc-02f018703072eb68b]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.apigw_setup will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "apigw_setup"  {
      ~ id       = "6fba4c4f8b3df736867b6e45334f595e4c0ab0788e259c5253e1b103f0d5a2e7" -> "1b4843ca467947533ad6fa6f19166e847959de888a5eeff4df4ddb69ad37160f"
      ~ rendered = <<~EOT
            #!/bin/bash
            
            #
            # Public keys for ssh
            #
            touch /home/"ec2-user"/.ssh/authorized_keys
            
            echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCLq0/1vhgRfispsHZHrX2H8Mz/HgtTSOiVlMmaUZE0xYPmTBf0cjpHggEN/vwM7FtAkoqozzkdA9PmlBXYye/7orNBGgOR/kXp2ssmyw80inrrCNgd5u6xKWwsydMXJZgvUHWu8PclM3xDNIkFr44ZwpUUJ4xoOzQNOoDjjL6te9rM6ZDXknQLYNf9gm6Isy584TP/kgtUGeS3megv0b+IE187AdLxllPRWCKp8rIWPBFFbP4TBiqWi5WJSJh+r8Z6DjfU/OTPPFgdiuaXjlHr/eGgKDx6merneLmt+rjb/dOxNbQErRzaCY0mZT9umod1vTZJS/4hV31ieXWr+ntF dmannarino_gfw" >> /home/ec2-user/.ssh/authorized_keys
            echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC2CK+B7W21KNwYK9OYNgBME0ski/Iv92uyljXdIq8q6UjczaiuOx9k2uFTBKzRfcnUkd3/Csr7utw/grSZEAJz/nRq0r1LzW+CBv7FMuhAzQ0iO/dSLwgD0Jygb3y52o/P/raPobADFzpS1tOeX+RtOIEHT2Ki7m7FIdOAmHJ7iOSmpGpe/XSkrA3pjewVX2S/FKmTqgrRFsSxYbH0UlrX3AvetZOMCYsK5r0eWc+Pcifq2qEPc6uRasoLwlVj4f51llT36ILGvvQZJX/8JiBzhAo8Yg8Qz0S62tGCHpgLEOdTJu6ZyKA6xiq6YWwOxSEPq99L0pur0ahbLvmIJp0PPvhz9yMpdQCUu+wh0xy4fLtFm+112/uGl7THKiGWc/oM8VPNdF8ZtjU2FWA3oP1ZKm7uAKXw/pXiG50wYjaqh8joGoDn5d41vMfHCWC0ZsTyNYRDNIm2mKQBUQNdEiBYWOx2HVgWWbQbff2JMLS4qy5lnwBhL0GZArB6eSJsLiU= edward@3sidedcube.com" >> /home/ec2-user/.ssh/authorized_keys
            echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDAIRH+V6hqIpFfPrw+7SkeROHr30Meci99Nc7fmeIxdlxR+yJPlogLFauj3D/4MMSvx+p4QjULd0TKO9Pc7b92vX1diqSNq3dom79ccZlntA+ITaS1DzmMcIcX3/szBUCmEeBYDw+v7Z7A77PvUQqxlLfx0I34JQEyF59XxVIwisz0tACaY1iLvdCAEypMTRWm1hDQPPRYJUHQ3VyOJ4XMUTo6iP4dwv3W1gKhq6Kpc00Ha1FBtpLSRtJhLqxq0kT9T2dYpvF3xf/r569PVolES/IBkgM/Vobbb3THrmH0TXKZNydaI1gLZC3y38nSmVJ/B2SH7AYwgBTkfO6jYez1 2021-08-04" >> /home/ec2-user/.ssh/authorized_keys
            echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDlNQHV5VApZuneWtc9m9d7WEUqmfoLWm0John5vRwoPC0GYIU56BH90Yeiw5HkXJsiqnO+WXubFqWylhCRyfckNiTC7sKbpydZHVH4VmvNzOV4z8BXPob1qsnL2d+5eO8U7Sf21jpBQ4HEXgBk4GZ4eRuktM4eYRGsgTRW/FLFUex6c76Nb5va0FakDKXNKiojIoTIjLN0sxKAQtxuJAt4X4Jg6rtd5pS/4l9pH/VPncKcag1tDvx5ytN/4+lb9IZg/8OyG5JZDWaCsvhauJxn+LGP3GtHiEmiu3IMvTwthVWBj1rmFaX/KoOSlQazHlzEREHQ51mb+6MXSwoz+WrqcgkvFLtky0syMRqwjBgCU2IoKS/Cn2+qh7pI0L7ctPb7WjKmQw7vTfQDW3IDPPU2/H2WlJRChrLMWYzFt6oBWKDr4D7YwH89LYsA67rR9xZHY6TgmVexjiXPjnawAqHKEryESqSuNLDWQmNwrGJaWzmf04T3N+5puDIyuhq5MIlbP63mxSXOUEsFIsCKZPkuh/oR105cbSW3U2fZIajuNICXU/YETChn9K7CaR53uqWM7A6vU2VipNb8NJ4v0IP1djECR3/HwrCY+04Fvt/ZOzbvME6cXxfPZLCDRF9Styz4NiTKPQz/6g3Gbl6CF86vdG8uVKmLRUbSBUbEJX02Sw==" >> /home/ec2-user/.ssh/authorized_keys
            echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCEdC0wsDmfQ2OFazxOqOSMn4hULT91irwpqLHpXac4r2xwZD+w+IvdFUouaQKEyI01Gki8uWlLXjfj0HSBrL+PKIwS4KsXkvgnqi/TTh2pJuOUIowV7IyO36ZtTP9wTIBteaG7HtNPTk/KUkdlNg1NA9Ds720OhLkf0Y4x2EUxln7bTaruCPTEP1YrAlmDsjHR3saw+xYKaElZk0SO6FTqd96GLpZ1kNJx/85nV0vV19NoL7MU84XhaVp5D8fNrxw4G6tm5orrUCWdfOA6mCgcYWS2bY/Ukq/zTTFb26irwGUJDAoCSiFQ8ljUlhSW1qoLhITPAjtSszUiTpIPmAst gtempus_gfw" >> /home/ec2-user/.ssh/authorized_keys
            echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDI3Vd+ksZNDpkxKLdwgHD5FZ8ngUk7Xvj9cV9nlGQ90ti77d+QtqRjGYpCmechizl5BEaaT9xi1DH8W7h3Isu85CnuAQqwb5lZMKDGsEzQTzxZ7h3AuMFkMNrN3d7PupwFifLVXmQF5R7E9I0EIGTrtnrINrzWMuU4VxVu3N0z3VDdkAvOAPDARaggr9K5zvmxB8NQ0iXCafNFk5bsddour/yxmWXxT7M3+qDB3CcHVzFqtMKVPyAs9HSuEfNBpenSTyNCMw78Bn7uvTzZdVlLIfmvz4H17pwKnoQTf3TEzTmpKg8A3XaqbHVrFODr7zl11tVxykA5nsy+FdeRu2z8quUji/qK0tStAd/1F6a19bLZ1rvlZp5uGbQnMuqNqiuEJs0F90VqcaEZ1wZe7d6EFPr++Yby2hUEo/eh3X8aSg50uog5S4f3pnbzB6RTB1dwLZWMo/tTx0UW/SavrbTcQlCOm31uKfJWkOgVW/lVikPq0O7k903OMIPPMSkCJ3U= iuripopov@Iuris-MacBook-Pro.local" >> /home/ec2-user/.ssh/authorized_keys
            echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCOGcXvYQel176C7gXPPsz8/tOotAJ8yfj4I2e1Uw0KMLgMao/9Yl9DZg9obBO7nG1DiDW9YUt2hpQkB2PpzP5N9yMriL4WXEhLroCWKj/vljRIDZjS3ZG+pPLs2Li9eFLDc0WGb9D+dxVG7Emwg8O/mTVbaAdklC4D1cwKQx7V7kU19K4jTTCA7aqagtI7X6FNh0fJGfVz0aQ01ECZmUNCkVZy+LYhk2wxSDuXV9DIha0akPXZCWqOtICPln+tquM9befLevCcuDpwVOkh1wrAP7EkRQtL8x8lIadenQpHgXoeoNGGp7x10Dywlw2u6Hm4b0mGITu4P1JTf0O2mmDd jterry_gfw" >> /home/ec2-user/.ssh/authorized_keys
            echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDI3Vd+ksZNDpkxKLdwgHD5FZ8ngUk7Xvj9cV9nlGQ90ti77d+QtqRjGYpCmechizl5BEaaT9xi1DH8W7h3Isu85CnuAQqwb5lZMKDGsEzQTzxZ7h3AuMFkMNrN3d7PupwFifLVXmQF5R7E9I0EIGTrtnrINrzWMuU4VxVu3N0z3VDdkAvOAPDARaggr9K5zvmxB8NQ0iXCafNFk5bsddour/yxmWXxT7M3+qDB3CcHVzFqtMKVPyAs9HSuEfNBpenSTyNCMw78Bn7uvTzZdVlLIfmvz4H17pwKnoQTf3TEzTmpKg8A3XaqbHVrFODr7zl11tVxykA5nsy+FdeRu2z8quUji/qK0tStAd/1F6a19bLZ1rvlZp5uGbQnMuqNqiuEJs0F90VqcaEZ1wZe7d6EFPr++Yby2hUEo/eh3X8aSg50uog5S4f3pnbzB6RTB1dwLZWMo/tTx0UW/SavrbTcQlCOm31uKfJWkOgVW/lVikPq0O7k903OMIPPMSkCJ3U= 2022-04-14" >> /home/ec2-user/.ssh/authorized_keys
            echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDdy9oatA/nDCdGpBusaK/XiqSWrWSMtVkBQAfIEznZf1vCUsbOrgLQTYJWbuPaHj0IBzZlEeFATLEY04GIYa++t1du1JAIJqd2bhNYrEGYPimkzF11k93UygIuYnDdgJfApwyibdvUj63xtgP/INzUJan2NdgGZ/pg7ZJAbPMZgtE+QO8qFZkHIsnnAyJl+ZyV5SrMjK+5Qxv05TuR+bb1sGg05IW2uqAHdRMZEREfRdDoo1jVU7oIsHbNJQdSvA6kC0NBfIn0M1nb/br6t+Gr7oACzpOs/JKSOinIi0l1pJZ1dDoQTS5ACppUh5MXjgsmGCxYk7pN7x0vTj+bxQBFLbJZklK/dTAPVO8MKIFDHgfnh4LyoEPnOcpkUcmZ3Dxl1PulEYmtQRkOdQPI5jkF2SOT/iJ42UIgMZ1m08ZOT4wf+oKncW9Rb/4uo+PHRddrdBcyS/dZHkLDogvYNpMXpeJyniRHcEsXszv5HPPf88Ka93pj0N1btz0bwgpG8Yc= owen@3s-MacBook-Pro.local" >> /home/ec2-user/.ssh/authorized_keys
            echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDHwKzgoKejAQHhT9Uw8WcXoq8e8YkJ9N4L/fCRkNqarvZfn6uo+u4iq5W0UEVOnjBgANCrCtkmV/z6xlZ6P+ncrqJbimYSfNxE5KAkSvfsCKOfxcKI3y3uoM+SSSC61A4IK4/RgckYcR71KZeQ21/2WyPTnqyJSweseDvyp26fAoGcFjErUJdfU/bYC5PkQ6rg3F2yfVufCvRIRVUf5ZM4tFDgGAosut3sB7xjiplz2vEZAmA9l6f3IcKFEFHAHuje+FFy9lLtG/i3PZD3WICrcAboprw42tnPHXqgP++UTYZHknw5DFfZPtcXV+OON97ObdmgRuWLCDbHFpuuvpOjZ8EiBAHL7gNTcrmx38rsHtWD/yIFBuXFkpHKfGPHrXNBYEaQwKnCBhs5GKuFNNkCPx1M1gOlIAuTDowOcvEjULIeCNdrOVVjVVxkcls00/G6bTmmZIZIOz3v3SqtJBp/0id9P8xPVwMeqkVhH7RvGoSPoYgg2FUkvr/vM5owlb0= solomon.negusse@wri.org" >> /home/ec2-user/.ssh/authorized_keys
          - echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCGI+i2fgsYXajjgKPPv3prXdEuFEQXrgtM6mVCK6nZeziuSW/3F0Y1JTCPp/SOw0p5I6ila0f1pzofeCeH+0MSwQ4q+tg66a6ZkgV16LWo0VYptBTIbDTUdp/O0KjxCviQLcZByvDd0AJAX81Cu7ChmZen0dq6U3lp9XWCQ/Lt3z2D8avikHvvtc9DZr6AmUD+fGEMBjKJI2KG7OizLJTLB2tvNJ5teEGNRVNI7ZiSgVg98Z0OeOODIM2QuVvU6xb6iCdGKdLRiNGf4Eq4Z71eiph+noaItziABWkiGha4EFbIWf4lKlH45mQn6BYhVtwtLnx6qsVA+PaErJuticnd tmaschler_gfw" >> /home/ec2-user/.ssh/authorized_keys
            echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDEZ2a1o2OQCvScQipFvnQ7OrCxWRx7QwGa76BB6YJ9aex13AANeMXQQ3hLWdKvTA03N47x6CwbwBcFs532Oc0EFjYrFYmt3/ZrUW87OKC0LJz+i9Ap7HfMtJWAKL5HyFWTqL1ohsXrXftdotq54rfJK2xJ+hRsFVKXxd8FFVhPNAN5nV7oVf+7Q9/WnPwXcHJvPQCys6oiDCySk0a9P76sW1vSFghAIokgMsFYK9PE5gLP4wT3G13A+Z+VOZTLzUJHoYRnFK/QPI2P5fAf7vstVYwIdDhw9NwZF2j9bTabQsqJrxVUrqCX2A2xEzLgfbVQm4JG5LWxneLTkzX1vzHr" >> /home/ec2-user/.ssh/authorized_keys
            
            
            chown ec2-user: /home/"ec2-user"/.ssh/authorized_keys
            chmod 0600 /home/"ec2-user"/.ssh/authorized_keys
        EOT
        template = <<~EOT
            #!/bin/bash
            
            #
            # Public keys for ssh
            #
            touch /home/"${user}"/.ssh/authorized_keys
            
            ${authorized_ssh_keys}
            
            chown ${user}: /home/"${user}"/.ssh/authorized_keys
            chmod 0600 /home/"${user}"/.ssh/authorized_keys
        EOT
      ~ vars     = {
          ~ "authorized_ssh_keys" = <<~EOT
                echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCLq0/1vhgRfispsHZHrX2H8Mz/HgtTSOiVlMmaUZE0xYPmTBf0cjpHggEN/vwM7FtAkoqozzkdA9PmlBXYye/7orNBGgOR/kXp2ssmyw80inrrCNgd5u6xKWwsydMXJZgvUHWu8PclM3xDNIkFr44ZwpUUJ4xoOzQNOoDjjL6te9rM6ZDXknQLYNf9gm6Isy584TP/kgtUGeS3megv0b+IE187AdLxllPRWCKp8rIWPBFFbP4TBiqWi5WJSJh+r8Z6DjfU/OTPPFgdiuaXjlHr/eGgKDx6merneLmt+rjb/dOxNbQErRzaCY0mZT9umod1vTZJS/4hV31ieXWr+ntF dmannarino_gfw" >> /home/ec2-user/.ssh/authorized_keys
                echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC2CK+B7W21KNwYK9OYNgBME0ski/Iv92uyljXdIq8q6UjczaiuOx9k2uFTBKzRfcnUkd3/Csr7utw/grSZEAJz/nRq0r1LzW+CBv7FMuhAzQ0iO/dSLwgD0Jygb3y52o/P/raPobADFzpS1tOeX+RtOIEHT2Ki7m7FIdOAmHJ7iOSmpGpe/XSkrA3pjewVX2S/FKmTqgrRFsSxYbH0UlrX3AvetZOMCYsK5r0eWc+Pcifq2qEPc6uRasoLwlVj4f51llT36ILGvvQZJX/8JiBzhAo8Yg8Qz0S62tGCHpgLEOdTJu6ZyKA6xiq6YWwOxSEPq99L0pur0ahbLvmIJp0PPvhz9yMpdQCUu+wh0xy4fLtFm+112/uGl7THKiGWc/oM8VPNdF8ZtjU2FWA3oP1ZKm7uAKXw/pXiG50wYjaqh8joGoDn5d41vMfHCWC0ZsTyNYRDNIm2mKQBUQNdEiBYWOx2HVgWWbQbff2JMLS4qy5lnwBhL0GZArB6eSJsLiU= edward@3sidedcube.com" >> /home/ec2-user/.ssh/authorized_keys
                echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDAIRH+V6hqIpFfPrw+7SkeROHr30Meci99Nc7fmeIxdlxR+yJPlogLFauj3D/4MMSvx+p4QjULd0TKO9Pc7b92vX1diqSNq3dom79ccZlntA+ITaS1DzmMcIcX3/szBUCmEeBYDw+v7Z7A77PvUQqxlLfx0I34JQEyF59XxVIwisz0tACaY1iLvdCAEypMTRWm1hDQPPRYJUHQ3VyOJ4XMUTo6iP4dwv3W1gKhq6Kpc00Ha1FBtpLSRtJhLqxq0kT9T2dYpvF3xf/r569PVolES/IBkgM/Vobbb3THrmH0TXKZNydaI1gLZC3y38nSmVJ/B2SH7AYwgBTkfO6jYez1 2021-08-04" >> /home/ec2-user/.ssh/authorized_keys
                echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDlNQHV5VApZuneWtc9m9d7WEUqmfoLWm0John5vRwoPC0GYIU56BH90Yeiw5HkXJsiqnO+WXubFqWylhCRyfckNiTC7sKbpydZHVH4VmvNzOV4z8BXPob1qsnL2d+5eO8U7Sf21jpBQ4HEXgBk4GZ4eRuktM4eYRGsgTRW/FLFUex6c76Nb5va0FakDKXNKiojIoTIjLN0sxKAQtxuJAt4X4Jg6rtd5pS/4l9pH/VPncKcag1tDvx5ytN/4+lb9IZg/8OyG5JZDWaCsvhauJxn+LGP3GtHiEmiu3IMvTwthVWBj1rmFaX/KoOSlQazHlzEREHQ51mb+6MXSwoz+WrqcgkvFLtky0syMRqwjBgCU2IoKS/Cn2+qh7pI0L7ctPb7WjKmQw7vTfQDW3IDPPU2/H2WlJRChrLMWYzFt6oBWKDr4D7YwH89LYsA67rR9xZHY6TgmVexjiXPjnawAqHKEryESqSuNLDWQmNwrGJaWzmf04T3N+5puDIyuhq5MIlbP63mxSXOUEsFIsCKZPkuh/oR105cbSW3U2fZIajuNICXU/YETChn9K7CaR53uqWM7A6vU2VipNb8NJ4v0IP1djECR3/HwrCY+04Fvt/ZOzbvME6cXxfPZLCDRF9Styz4NiTKPQz/6g3Gbl6CF86vdG8uVKmLRUbSBUbEJX02Sw==" >> /home/ec2-user/.ssh/authorized_keys
                echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCEdC0wsDmfQ2OFazxOqOSMn4hULT91irwpqLHpXac4r2xwZD+w+IvdFUouaQKEyI01Gki8uWlLXjfj0HSBrL+PKIwS4KsXkvgnqi/TTh2pJuOUIowV7IyO36ZtTP9wTIBteaG7HtNPTk/KUkdlNg1NA9Ds720OhLkf0Y4x2EUxln7bTaruCPTEP1YrAlmDsjHR3saw+xYKaElZk0SO6FTqd96GLpZ1kNJx/85nV0vV19NoL7MU84XhaVp5D8fNrxw4G6tm5orrUCWdfOA6mCgcYWS2bY/Ukq/zTTFb26irwGUJDAoCSiFQ8ljUlhSW1qoLhITPAjtSszUiTpIPmAst gtempus_gfw" >> /home/ec2-user/.ssh/authorized_keys
                echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDI3Vd+ksZNDpkxKLdwgHD5FZ8ngUk7Xvj9cV9nlGQ90ti77d+QtqRjGYpCmechizl5BEaaT9xi1DH8W7h3Isu85CnuAQqwb5lZMKDGsEzQTzxZ7h3AuMFkMNrN3d7PupwFifLVXmQF5R7E9I0EIGTrtnrINrzWMuU4VxVu3N0z3VDdkAvOAPDARaggr9K5zvmxB8NQ0iXCafNFk5bsddour/yxmWXxT7M3+qDB3CcHVzFqtMKVPyAs9HSuEfNBpenSTyNCMw78Bn7uvTzZdVlLIfmvz4H17pwKnoQTf3TEzTmpKg8A3XaqbHVrFODr7zl11tVxykA5nsy+FdeRu2z8quUji/qK0tStAd/1F6a19bLZ1rvlZp5uGbQnMuqNqiuEJs0F90VqcaEZ1wZe7d6EFPr++Yby2hUEo/eh3X8aSg50uog5S4f3pnbzB6RTB1dwLZWMo/tTx0UW/SavrbTcQlCOm31uKfJWkOgVW/lVikPq0O7k903OMIPPMSkCJ3U= iuripopov@Iuris-MacBook-Pro.local" >> /home/ec2-user/.ssh/authorized_keys
                echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCOGcXvYQel176C7gXPPsz8/tOotAJ8yfj4I2e1Uw0KMLgMao/9Yl9DZg9obBO7nG1DiDW9YUt2hpQkB2PpzP5N9yMriL4WXEhLroCWKj/vljRIDZjS3ZG+pPLs2Li9eFLDc0WGb9D+dxVG7Emwg8O/mTVbaAdklC4D1cwKQx7V7kU19K4jTTCA7aqagtI7X6FNh0fJGfVz0aQ01ECZmUNCkVZy+LYhk2wxSDuXV9DIha0akPXZCWqOtICPln+tquM9befLevCcuDpwVOkh1wrAP7EkRQtL8x8lIadenQpHgXoeoNGGp7x10Dywlw2u6Hm4b0mGITu4P1JTf0O2mmDd jterry_gfw" >> /home/ec2-user/.ssh/authorized_keys
                echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDI3Vd+ksZNDpkxKLdwgHD5FZ8ngUk7Xvj9cV9nlGQ90ti77d+QtqRjGYpCmechizl5BEaaT9xi1DH8W7h3Isu85CnuAQqwb5lZMKDGsEzQTzxZ7h3AuMFkMNrN3d7PupwFifLVXmQF5R7E9I0EIGTrtnrINrzWMuU4VxVu3N0z3VDdkAvOAPDARaggr9K5zvmxB8NQ0iXCafNFk5bsddour/yxmWXxT7M3+qDB3CcHVzFqtMKVPyAs9HSuEfNBpenSTyNCMw78Bn7uvTzZdVlLIfmvz4H17pwKnoQTf3TEzTmpKg8A3XaqbHVrFODr7zl11tVxykA5nsy+FdeRu2z8quUji/qK0tStAd/1F6a19bLZ1rvlZp5uGbQnMuqNqiuEJs0F90VqcaEZ1wZe7d6EFPr++Yby2hUEo/eh3X8aSg50uog5S4f3pnbzB6RTB1dwLZWMo/tTx0UW/SavrbTcQlCOm31uKfJWkOgVW/lVikPq0O7k903OMIPPMSkCJ3U= 2022-04-14" >> /home/ec2-user/.ssh/authorized_keys
                echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDdy9oatA/nDCdGpBusaK/XiqSWrWSMtVkBQAfIEznZf1vCUsbOrgLQTYJWbuPaHj0IBzZlEeFATLEY04GIYa++t1du1JAIJqd2bhNYrEGYPimkzF11k93UygIuYnDdgJfApwyibdvUj63xtgP/INzUJan2NdgGZ/pg7ZJAbPMZgtE+QO8qFZkHIsnnAyJl+ZyV5SrMjK+5Qxv05TuR+bb1sGg05IW2uqAHdRMZEREfRdDoo1jVU7oIsHbNJQdSvA6kC0NBfIn0M1nb/br6t+Gr7oACzpOs/JKSOinIi0l1pJZ1dDoQTS5ACppUh5MXjgsmGCxYk7pN7x0vTj+bxQBFLbJZklK/dTAPVO8MKIFDHgfnh4LyoEPnOcpkUcmZ3Dxl1PulEYmtQRkOdQPI5jkF2SOT/iJ42UIgMZ1m08ZOT4wf+oKncW9Rb/4uo+PHRddrdBcyS/dZHkLDogvYNpMXpeJyniRHcEsXszv5HPPf88Ka93pj0N1btz0bwgpG8Yc= owen@3s-MacBook-Pro.local" >> /home/ec2-user/.ssh/authorized_keys
                echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDHwKzgoKejAQHhT9Uw8WcXoq8e8YkJ9N4L/fCRkNqarvZfn6uo+u4iq5W0UEVOnjBgANCrCtkmV/z6xlZ6P+ncrqJbimYSfNxE5KAkSvfsCKOfxcKI3y3uoM+SSSC61A4IK4/RgckYcR71KZeQ21/2WyPTnqyJSweseDvyp26fAoGcFjErUJdfU/bYC5PkQ6rg3F2yfVufCvRIRVUf5ZM4tFDgGAosut3sB7xjiplz2vEZAmA9l6f3IcKFEFHAHuje+FFy9lLtG/i3PZD3WICrcAboprw42tnPHXqgP++UTYZHknw5DFfZPtcXV+OON97ObdmgRuWLCDbHFpuuvpOjZ8EiBAHL7gNTcrmx38rsHtWD/yIFBuXFkpHKfGPHrXNBYEaQwKnCBhs5GKuFNNkCPx1M1gOlIAuTDowOcvEjULIeCNdrOVVjVVxkcls00/G6bTmmZIZIOz3v3SqtJBp/0id9P8xPVwMeqkVhH7RvGoSPoYgg2FUkvr/vM5owlb0= solomon.negusse@wri.org" >> /home/ec2-user/.ssh/authorized_keys
              - echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCGI+i2fgsYXajjgKPPv3prXdEuFEQXrgtM6mVCK6nZeziuSW/3F0Y1JTCPp/SOw0p5I6ila0f1pzofeCeH+0MSwQ4q+tg66a6ZkgV16LWo0VYptBTIbDTUdp/O0KjxCviQLcZByvDd0AJAX81Cu7ChmZen0dq6U3lp9XWCQ/Lt3z2D8avikHvvtc9DZr6AmUD+fGEMBjKJI2KG7OizLJTLB2tvNJ5teEGNRVNI7ZiSgVg98Z0OeOODIM2QuVvU6xb6iCdGKdLRiNGf4Eq4Z71eiph+noaItziABWkiGha4EFbIWf4lKlH45mQn6BYhVtwtLnx6qsVA+PaErJuticnd tmaschler_gfw" >> /home/ec2-user/.ssh/authorized_keys
                echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDEZ2a1o2OQCvScQipFvnQ7OrCxWRx7QwGa76BB6YJ9aex13AANeMXQQ3hLWdKvTA03N47x6CwbwBcFs532Oc0EFjYrFYmt3/ZrUW87OKC0LJz+i9Ap7HfMtJWAKL5HyFWTqL1ohsXrXftdotq54rfJK2xJ+hRsFVKXxd8FFVhPNAN5nV7oVf+7Q9/WnPwXcHJvPQCys6oiDCySk0a9P76sW1vSFghAIokgMsFYK9PE5gLP4wT3G13A+Z+VOZTLzUJHoYRnFK/QPI2P5fAf7vstVYwIdDhw9NwZF2j9bTabQsqJrxVUrqCX2A2xEzLgfbVQm4JG5LWxneLTkzX1vzHr" >> /home/ec2-user/.ssh/authorized_keys
            EOT
            "user"                = "ec2-user"
        }
    }

  # aws_acm_certificate.globalforestwatch_new[0] will be created
  + resource "aws_acm_certificate" "globalforestwatch_new" {
      + arn                       = (known after apply)
      + domain_name               = "*.globalforestwatch.org"
      + domain_validation_options = [
          + {
              + domain_name           = "*.globalforestwatch.org"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + tags                      = {
          + "BuiltBy"     = "Terraform"
          + "Environment" = "staging"
          + "Name"        = "Global Forest Watch Wildcard"
          + "Project"     = "Global Forest Watch"
        }
      + tags_all                  = {
          + "BuiltBy"     = "Terraform"
          + "Environment" = "staging"
          + "Name"        = "Global Forest Watch Wildcard"
          + "Project"     = "Global Forest Watch"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_eip_association.eip_assoc must be replaced
-/+ resource "aws_eip_association" "eip_assoc" {
        allocation_id        = "eipalloc-031415c612faebf6f"
      ~ id                   = "eipassoc-042efffeb1e2cd979" -> (known after apply)
      ~ instance_id          = "i-0f188dd59d7539b20" -> (known after apply) # forces replacement
      ~ network_interface_id = "eni-086117b614cae7961" -> (known after apply)
      ~ private_ip_address   = "10.0.9.6" -> (known after apply)
      ~ public_ip            = "3.218.18.175" -> (known after apply)
    }

  # aws_instance.apigw must be replaced
-/+ resource "aws_instance" "apigw" {
      ~ ami                                  = "ami-00db75007d6c5c578" -> "ami-065efef2c739d613b"
      ~ arn                                  = "arn:aws:ec2:us-east-1:274931322839:instance/i-0f188dd59d7539b20" -> (known after apply)
        associate_public_ip_address          = true
        availability_zone                    = "us-east-1a"
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
        ebs_optimized                        = true
        get_password_data                    = false
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      ~ id                                   = "i-0f188dd59d7539b20" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
        instance_type                        = "t3.large"
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + key_name                             = (known after apply)
        monitoring                           = true
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "eni-086117b614cae7961" -> (known after apply)
      ~ private_dns                          = "ip-10-0-9-6.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.9.6" -> (known after apply)
      ~ public_dns                           = "ec2-3-218-18-175.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "3.218.18.175" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
        source_dest_check                    = true
        subnet_id                            = "subnet-0c6313b7687bffe32"
        tags                                 = {
            "BuiltBy"     = "Terraform"
            "Environment" = "staging"
            "Name"        = "Global Forest Watch-ApiGW"
            "Project"     = "Global Forest Watch"
        }
        tags_all                             = {
            "BuiltBy"     = "Terraform"
            "Environment" = "staging"
            "Name"        = "Global Forest Watch-ApiGW"
            "Project"     = "Global Forest Watch"
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = "e3cca9ece2fc5a777da4f05947e312f99dea68ec" -> "837c9cabcac315607ceb455ae83ae8879c652e10" # forces replacement
      + user_data_base64                     = (known after apply)
        vpc_security_group_ids               = [
            "sg-065df0427c77571bb",
            "sg-08b8b35b8686cbc51",
        ]

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-060787477fec817a9" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # aws_key_pair.all["gtempus_gfw"] will be created
  + resource "aws_key_pair" "all" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "gtempus_gfw"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCEdC0wsDmfQ2OFazxOqOSMn4hULT91irwpqLHpXac4r2xwZD+w+IvdFUouaQKEyI01Gki8uWlLXjfj0HSBrL+PKIwS4KsXkvgnqi/TTh2pJuOUIowV7IyO36ZtTP9wTIBteaG7HtNPTk/KUkdlNg1NA9Ds720OhLkf0Y4x2EUxln7bTaruCPTEP1YrAlmDsjHR3saw+xYKaElZk0SO6FTqd96GLpZ1kNJx/85nV0vV19NoL7MU84XhaVp5D8fNrxw4G6tm5orrUCWdfOA6mCgcYWS2bY/Ukq/zTTFb26irwGUJDAoCSiFQ8ljUlhSW1qoLhITPAjtSszUiTpIPmAst gtempus_gfw"
      + tags_all        = (known after apply)
    }

  # aws_key_pair.all["tmaschler_gfw"] will be destroyed
  - resource "aws_key_pair" "all" {
      - arn         = "arn:aws:ec2:us-east-1:274931322839:key-pair/tmaschler_gfw" -> null
      - fingerprint = "80:bb:f4:96:2c:5e:29:33:0b:0d:9d:bb:ea:f0:64:e0" -> null
      - id          = "tmaschler_gfw" -> null
      - key_name    = "tmaschler_gfw" -> null
      - key_pair_id = "key-05c4a8ed62f7dc686" -> null
      - public_key  = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCGI+i2fgsYXajjgKPPv3prXdEuFEQXrgtM6mVCK6nZeziuSW/3F0Y1JTCPp/SOw0p5I6ila0f1pzofeCeH+0MSwQ4q+tg66a6ZkgV16LWo0VYptBTIbDTUdp/O0KjxCviQLcZByvDd0AJAX81Cu7ChmZen0dq6U3lp9XWCQ/Lt3z2D8avikHvvtc9DZr6AmUD+fGEMBjKJI2KG7OizLJTLB2tvNJ5teEGNRVNI7ZiSgVg98Z0OeOODIM2QuVvU6xb6iCdGKdLRiNGf4Eq4Z71eiph+noaItziABWkiGha4EFbIWf4lKlH45mQn6BYhVtwtLnx6qsVA+PaErJuticnd tmaschler_gfw" -> null
      - tags        = {} -> null
      - tags_all    = {} -> null
    }

  # module.api_token_secret.aws_secretsmanager_secret_version.default must be replaced
-/+ resource "aws_secretsmanager_secret_version" "default" {
      ~ arn            = "arn:aws:secretsmanager:us-east-1:274931322839:secret:gfw-api/token-T2H6Cl" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:us-east-1:274931322839:secret:gfw-api/token-T2H6Cl|52A9A6A4-FD2B-4C21-BE05-BE9F02AB4DC7" -> (known after apply)
        secret_id      = "arn:aws:secretsmanager:us-east-1:274931322839:secret:gfw-api/token-T2H6Cl"
      ~ secret_string  = (sensitive value)
      ~ version_id     = "52A9A6A4-FD2B-4C21-BE05-BE9F02AB4DC7" -> (known after apply)
      ~ version_stages = [] -> (known after apply)
    }

  # module.firewall.aws_security_group_rule.ingress_ssh[2] must be replaced
-/+ resource "aws_security_group_rule" "ingress_ssh" {
      ~ cidr_blocks              = [ # forces replacement
          - "xxx.xxx.x.xx/32",
          + "192.168.1.10/32",
        ]
      ~ description              = "Thomas" -> "Justin"
        from_port                = 22
      ~ id                       = "sgrule-949562368" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
        protocol                 = "tcp"
        security_group_id        = "sg-065df0427c77571bb"
        self                     = false
      + source_security_group_id = (known after apply)
        to_port                  = 22
        type                     = "ingress"
    }

  # module.firewall.aws_security_group_rule.ingress_ssh[3] must be replaced
-/+ resource "aws_security_group_rule" "ingress_ssh" {
      ~ cidr_blocks              = [ # forces replacement
          - "xxx.xxx.x.xx/32",
          + "192.168.1.11/32",
        ]
      ~ description              = "Justin" -> "Daniel"
        from_port                = 22
      ~ id                       = "sgrule-2150105693" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
        protocol                 = "tcp"
        security_group_id        = "sg-065df0427c77571bb"
        self                     = false
      + source_security_group_id = (known after apply)
        to_port                  = 22
        type                     = "ingress"
    }

  # module.firewall.aws_security_group_rule.ingress_ssh[4] must be replaced
-/+ resource "aws_security_group_rule" "ingress_ssh" {
      ~ cidr_blocks              = [ # forces replacement
          - "xxx.xxx.x.xx/32",
          + "192.168.1.12/32",
        ]
      ~ description              = "Daniel" -> "Solomon"
        from_port                = 22
      ~ id                       = "sgrule-341043819" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
        protocol                 = "tcp"
        security_group_id        = "sg-065df0427c77571bb"
        self                     = false
      + source_security_group_id = (known after apply)
        to_port                  = 22
        type                     = "ingress"
    }

  # module.firewall.aws_security_group_rule.ingress_ssh[5] must be replaced
-/+ resource "aws_security_group_rule" "ingress_ssh" {
      ~ cidr_blocks              = [ # forces replacement
          - "xxx.xxx.x.xx/32",
          + "192.168.1.13/32",
        ]
      ~ description              = "Solomon" -> "Gary"
        from_port                = 22
      ~ id                       = "sgrule-3782876537" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
        protocol                 = "tcp"
        security_group_id        = "sg-065df0427c77571bb"
        self                     = false
      + source_security_group_id = (known after apply)
        to_port                  = 22
        type                     = "ingress"
    }

  # module.gcs_gfw_gee_export_secret.aws_secretsmanager_secret_version.default must be replaced
-/+ resource "aws_secretsmanager_secret_version" "default" {
      ~ arn            = "arn:aws:secretsmanager:us-east-1:274931322839:secret:gcs/gfw-gee-export-oOA3sc" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:us-east-1:274931322839:secret:gcs/gfw-gee-export-oOA3sc|5F1DF043-30C1-43F7-B0B1-7F62A6CA2709" -> (known after apply)
        secret_id      = "arn:aws:secretsmanager:us-east-1:274931322839:secret:gcs/gfw-gee-export-oOA3sc"
      ~ secret_string  = (sensitive value)
      ~ version_id     = "5F1DF043-30C1-43F7-B0B1-7F62A6CA2709" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
    }

  # module.planet_api_key_secret.aws_secretsmanager_secret_version.default must be replaced
-/+ resource "aws_secretsmanager_secret_version" "default" {
      ~ arn            = "arn:aws:secretsmanager:us-east-1:274931322839:secret:planet/api_key-HHudQO" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:us-east-1:274931322839:secret:planet/api_key-HHudQO|7C8B4C11-B3C3-4173-8BDB-48C6E89CEE58" -> (known after apply)
        secret_id      = "arn:aws:secretsmanager:us-east-1:274931322839:secret:planet/api_key-HHudQO"
      ~ secret_string  = (sensitive value)
      ~ version_id     = "7C8B4C11-B3C3-4173-8BDB-48C6E89CEE58" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
    }

  # module.postgresql.aws_rds_cluster.aurora_cluster will be updated in-place
  ~ resource "aws_rds_cluster" "aurora_cluster" {
        apply_immediately                   = true
        arn                                 = "arn:aws:rds:us-east-1:274931322839:cluster:gfw-aurora"
        availability_zones                  = [
            "us-east-1a",
            "us-east-1b",
            "us-east-1d",
        ]
        backtrack_window                    = 0
        backup_retention_period             = 1
        cluster_identifier                  = "gfw-aurora"
        cluster_members                     = [
            "application-autoscaling-698c9c01-db99-4430-a97a-6baaae853dc6",
            "core-aurora-instance-0",
        ]
        cluster_resource_id                 = "cluster-FX4UXHDFY2KKJC25ZW3RB6WHAU"
        copy_tags_to_snapshot               = true
        database_name                       = "geostore"
        db_cluster_parameter_group_name     = "default.aurora-postgresql12"
        db_subnet_group_name                = "main"
        deletion_protection                 = false
        enable_global_write_forwarding      = false
        enable_http_endpoint                = false
        enabled_cloudwatch_logs_exports     = [
            "postgresql",
        ]
        endpoint                            = "gfw-aurora.cluster-cljrqsduwhdo.us-east-1.rds.amazonaws.com"
        engine                              = "aurora-postgresql"
        engine_mode                         = "provisioned"
        engine_version                      = "12.8"
        engine_version_actual               = "12.8"
        final_snapshot_identifier           = "core-aurora-cluster"
        hosted_zone_id                      = "Z2R2ITUGPM61AM"
        iam_database_authentication_enabled = false
        iam_roles                           = []
        id                                  = "gfw-aurora"
        kms_key_id                          = "arn:aws:kms:us-east-1:274931322839:key/8c47651e-a11f-444d-8013-9334fbac400f"
      ~ master_password                     = (sensitive value)
        master_username                     = "gfw"
        port                                = 5432
        preferred_backup_window             = "14:00-15:00"
        preferred_maintenance_window        = "sat:16:00-sat:17:00"
        reader_endpoint                     = "gfw-aurora.cluster-ro-cljrqsduwhdo.us-east-1.rds.amazonaws.com"
        skip_final_snapshot                 = false
        storage_encrypted                   = true
        tags                                = {
            "BuiltBy"     = "Terraform"
            "Environment" = "staging"
            "Job"         = "Geostore"
            "Name"        = "core-Aurora-DB-Cluster"
            "Project"     = "Global Forest Watch"
        }
        tags_all                            = {
            "BuiltBy"     = "Terraform"
            "Environment" = "staging"
            "Job"         = "Geostore"
            "Name"        = "core-Aurora-DB-Cluster"
            "Project"     = "Global Forest Watch"
        }
        vpc_security_group_ids              = [
            "sg-0eac0da129448b72e",
        ]
    }

  # module.slack_secret.aws_secretsmanager_secret_version.default must be replaced
-/+ resource "aws_secretsmanager_secret_version" "default" {
      ~ arn            = "arn:aws:secretsmanager:us-east-1:274931322839:secret:slack/gfw-sync-X9BR6e" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:us-east-1:274931322839:secret:slack/gfw-sync-X9BR6e|1DD087EA-0951-457F-916F-5801D91ACF29" -> (known after apply)
        secret_id      = "arn:aws:secretsmanager:us-east-1:274931322839:secret:slack/gfw-sync-X9BR6e"
      ~ secret_string  = (sensitive value)
      ~ version_id     = "1DD087EA-0951-457F-916F-5801D91ACF29" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
    }

  # module.vpc.data.template_file.bastion_setup will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "bastion_setup"  {
      ~ id       = "6fba4c4f8b3df736867b6e45334f595e4c0ab0788e259c5253e1b103f0d5a2e7" -> "1b4843ca467947533ad6fa6f19166e847959de888a5eeff4df4ddb69ad37160f"
      ~ rendered = <<~EOT
            #!/bin/bash
            
            #
            # Public keys for ssh
            #
            touch /home/"ec2-user"/.ssh/authorized_keys
            
            echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCLq0/1vhgRfispsHZHrX2H8Mz/HgtTSOiVlMmaUZE0xYPmTBf0cjpHggEN/vwM7FtAkoqozzkdA9PmlBXYye/7orNBGgOR/kXp2ssmyw80inrrCNgd5u6xKWwsydMXJZgvUHWu8PclM3xDNIkFr44ZwpUUJ4xoOzQNOoDjjL6te9rM6ZDXknQLYNf9gm6Isy584TP/kgtUGeS3megv0b+IE187AdLxllPRWCKp8rIWPBFFbP4TBiqWi5WJSJh+r8Z6DjfU/OTPPFgdiuaXjlHr/eGgKDx6merneLmt+rjb/dOxNbQErRzaCY0mZT9umod1vTZJS/4hV31ieXWr+ntF dmannarino_gfw" >> /home/ec2-user/.ssh/authorized_keys
            echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC2CK+B7W21KNwYK9OYNgBME0ski/Iv92uyljXdIq8q6UjczaiuOx9k2uFTBKzRfcnUkd3/Csr7utw/grSZEAJz/nRq0r1LzW+CBv7FMuhAzQ0iO/dSLwgD0Jygb3y52o/P/raPobADFzpS1tOeX+RtOIEHT2Ki7m7FIdOAmHJ7iOSmpGpe/XSkrA3pjewVX2S/FKmTqgrRFsSxYbH0UlrX3AvetZOMCYsK5r0eWc+Pcifq2qEPc6uRasoLwlVj4f51llT36ILGvvQZJX/8JiBzhAo8Yg8Qz0S62tGCHpgLEOdTJu6ZyKA6xiq6YWwOxSEPq99L0pur0ahbLvmIJp0PPvhz9yMpdQCUu+wh0xy4fLtFm+112/uGl7THKiGWc/oM8VPNdF8ZtjU2FWA3oP1ZKm7uAKXw/pXiG50wYjaqh8joGoDn5d41vMfHCWC0ZsTyNYRDNIm2mKQBUQNdEiBYWOx2HVgWWbQbff2JMLS4qy5lnwBhL0GZArB6eSJsLiU= edward@3sidedcube.com" >> /home/ec2-user/.ssh/authorized_keys
            echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDAIRH+V6hqIpFfPrw+7SkeROHr30Meci99Nc7fmeIxdlxR+yJPlogLFauj3D/4MMSvx+p4QjULd0TKO9Pc7b92vX1diqSNq3dom79ccZlntA+ITaS1DzmMcIcX3/szBUCmEeBYDw+v7Z7A77PvUQqxlLfx0I34JQEyF59XxVIwisz0tACaY1iLvdCAEypMTRWm1hDQPPRYJUHQ3VyOJ4XMUTo6iP4dwv3W1gKhq6Kpc00Ha1FBtpLSRtJhLqxq0kT9T2dYpvF3xf/r569PVolES/IBkgM/Vobbb3THrmH0TXKZNydaI1gLZC3y38nSmVJ/B2SH7AYwgBTkfO6jYez1 2021-08-04" >> /home/ec2-user/.ssh/authorized_keys
            echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDlNQHV5VApZuneWtc9m9d7WEUqmfoLWm0John5vRwoPC0GYIU56BH90Yeiw5HkXJsiqnO+WXubFqWylhCRyfckNiTC7sKbpydZHVH4VmvNzOV4z8BXPob1qsnL2d+5eO8U7Sf21jpBQ4HEXgBk4GZ4eRuktM4eYRGsgTRW/FLFUex6c76Nb5va0FakDKXNKiojIoTIjLN0sxKAQtxuJAt4X4Jg6rtd5pS/4l9pH/VPncKcag1tDvx5ytN/4+lb9IZg/8OyG5JZDWaCsvhauJxn+LGP3GtHiEmiu3IMvTwthVWBj1rmFaX/KoOSlQazHlzEREHQ51mb+6MXSwoz+WrqcgkvFLtky0syMRqwjBgCU2IoKS/Cn2+qh7pI0L7ctPb7WjKmQw7vTfQDW3IDPPU2/H2WlJRChrLMWYzFt6oBWKDr4D7YwH89LYsA67rR9xZHY6TgmVexjiXPjnawAqHKEryESqSuNLDWQmNwrGJaWzmf04T3N+5puDIyuhq5MIlbP63mxSXOUEsFIsCKZPkuh/oR105cbSW3U2fZIajuNICXU/YETChn9K7CaR53uqWM7A6vU2VipNb8NJ4v0IP1djECR3/HwrCY+04Fvt/ZOzbvME6cXxfPZLCDRF9Styz4NiTKPQz/6g3Gbl6CF86vdG8uVKmLRUbSBUbEJX02Sw==" >> /home/ec2-user/.ssh/authorized_keys
            echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCEdC0wsDmfQ2OFazxOqOSMn4hULT91irwpqLHpXac4r2xwZD+w+IvdFUouaQKEyI01Gki8uWlLXjfj0HSBrL+PKIwS4KsXkvgnqi/TTh2pJuOUIowV7IyO36ZtTP9wTIBteaG7HtNPTk/KUkdlNg1NA9Ds720OhLkf0Y4x2EUxln7bTaruCPTEP1YrAlmDsjHR3saw+xYKaElZk0SO6FTqd96GLpZ1kNJx/85nV0vV19NoL7MU84XhaVp5D8fNrxw4G6tm5orrUCWdfOA6mCgcYWS2bY/Ukq/zTTFb26irwGUJDAoCSiFQ8ljUlhSW1qoLhITPAjtSszUiTpIPmAst gtempus_gfw" >> /home/ec2-user/.ssh/authorized_keys
            echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDI3Vd+ksZNDpkxKLdwgHD5FZ8ngUk7Xvj9cV9nlGQ90ti77d+QtqRjGYpCmechizl5BEaaT9xi1DH8W7h3Isu85CnuAQqwb5lZMKDGsEzQTzxZ7h3AuMFkMNrN3d7PupwFifLVXmQF5R7E9I0EIGTrtnrINrzWMuU4VxVu3N0z3VDdkAvOAPDARaggr9K5zvmxB8NQ0iXCafNFk5bsddour/yxmWXxT7M3+qDB3CcHVzFqtMKVPyAs9HSuEfNBpenSTyNCMw78Bn7uvTzZdVlLIfmvz4H17pwKnoQTf3TEzTmpKg8A3XaqbHVrFODr7zl11tVxykA5nsy+FdeRu2z8quUji/qK0tStAd/1F6a19bLZ1rvlZp5uGbQnMuqNqiuEJs0F90VqcaEZ1wZe7d6EFPr++Yby2hUEo/eh3X8aSg50uog5S4f3pnbzB6RTB1dwLZWMo/tTx0UW/SavrbTcQlCOm31uKfJWkOgVW/lVikPq0O7k903OMIPPMSkCJ3U= iuripopov@Iuris-MacBook-Pro.local" >> /home/ec2-user/.ssh/authorized_keys
            echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCOGcXvYQel176C7gXPPsz8/tOotAJ8yfj4I2e1Uw0KMLgMao/9Yl9DZg9obBO7nG1DiDW9YUt2hpQkB2PpzP5N9yMriL4WXEhLroCWKj/vljRIDZjS3ZG+pPLs2Li9eFLDc0WGb9D+dxVG7Emwg8O/mTVbaAdklC4D1cwKQx7V7kU19K4jTTCA7aqagtI7X6FNh0fJGfVz0aQ01ECZmUNCkVZy+LYhk2wxSDuXV9DIha0akPXZCWqOtICPln+tquM9befLevCcuDpwVOkh1wrAP7EkRQtL8x8lIadenQpHgXoeoNGGp7x10Dywlw2u6Hm4b0mGITu4P1JTf0O2mmDd jterry_gfw" >> /home/ec2-user/.ssh/authorized_keys
            echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDI3Vd+ksZNDpkxKLdwgHD5FZ8ngUk7Xvj9cV9nlGQ90ti77d+QtqRjGYpCmechizl5BEaaT9xi1DH8W7h3Isu85CnuAQqwb5lZMKDGsEzQTzxZ7h3AuMFkMNrN3d7PupwFifLVXmQF5R7E9I0EIGTrtnrINrzWMuU4VxVu3N0z3VDdkAvOAPDARaggr9K5zvmxB8NQ0iXCafNFk5bsddour/yxmWXxT7M3+qDB3CcHVzFqtMKVPyAs9HSuEfNBpenSTyNCMw78Bn7uvTzZdVlLIfmvz4H17pwKnoQTf3TEzTmpKg8A3XaqbHVrFODr7zl11tVxykA5nsy+FdeRu2z8quUji/qK0tStAd/1F6a19bLZ1rvlZp5uGbQnMuqNqiuEJs0F90VqcaEZ1wZe7d6EFPr++Yby2hUEo/eh3X8aSg50uog5S4f3pnbzB6RTB1dwLZWMo/tTx0UW/SavrbTcQlCOm31uKfJWkOgVW/lVikPq0O7k903OMIPPMSkCJ3U= 2022-04-14" >> /home/ec2-user/.ssh/authorized_keys
            echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDdy9oatA/nDCdGpBusaK/XiqSWrWSMtVkBQAfIEznZf1vCUsbOrgLQTYJWbuPaHj0IBzZlEeFATLEY04GIYa++t1du1JAIJqd2bhNYrEGYPimkzF11k93UygIuYnDdgJfApwyibdvUj63xtgP/INzUJan2NdgGZ/pg7ZJAbPMZgtE+QO8qFZkHIsnnAyJl+ZyV5SrMjK+5Qxv05TuR+bb1sGg05IW2uqAHdRMZEREfRdDoo1jVU7oIsHbNJQdSvA6kC0NBfIn0M1nb/br6t+Gr7oACzpOs/JKSOinIi0l1pJZ1dDoQTS5ACppUh5MXjgsmGCxYk7pN7x0vTj+bxQBFLbJZklK/dTAPVO8MKIFDHgfnh4LyoEPnOcpkUcmZ3Dxl1PulEYmtQRkOdQPI5jkF2SOT/iJ42UIgMZ1m08ZOT4wf+oKncW9Rb/4uo+PHRddrdBcyS/dZHkLDogvYNpMXpeJyniRHcEsXszv5HPPf88Ka93pj0N1btz0bwgpG8Yc= owen@3s-MacBook-Pro.local" >> /home/ec2-user/.ssh/authorized_keys
            echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDHwKzgoKejAQHhT9Uw8WcXoq8e8YkJ9N4L/fCRkNqarvZfn6uo+u4iq5W0UEVOnjBgANCrCtkmV/z6xlZ6P+ncrqJbimYSfNxE5KAkSvfsCKOfxcKI3y3uoM+SSSC61A4IK4/RgckYcR71KZeQ21/2WyPTnqyJSweseDvyp26fAoGcFjErUJdfU/bYC5PkQ6rg3F2yfVufCvRIRVUf5ZM4tFDgGAosut3sB7xjiplz2vEZAmA9l6f3IcKFEFHAHuje+FFy9lLtG/i3PZD3WICrcAboprw42tnPHXqgP++UTYZHknw5DFfZPtcXV+OON97ObdmgRuWLCDbHFpuuvpOjZ8EiBAHL7gNTcrmx38rsHtWD/yIFBuXFkpHKfGPHrXNBYEaQwKnCBhs5GKuFNNkCPx1M1gOlIAuTDowOcvEjULIeCNdrOVVjVVxkcls00/G6bTmmZIZIOz3v3SqtJBp/0id9P8xPVwMeqkVhH7RvGoSPoYgg2FUkvr/vM5owlb0= solomon.negusse@wri.org" >> /home/ec2-user/.ssh/authorized_keys
          - echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCGI+i2fgsYXajjgKPPv3prXdEuFEQXrgtM6mVCK6nZeziuSW/3F0Y1JTCPp/SOw0p5I6ila0f1pzofeCeH+0MSwQ4q+tg66a6ZkgV16LWo0VYptBTIbDTUdp/O0KjxCviQLcZByvDd0AJAX81Cu7ChmZen0dq6U3lp9XWCQ/Lt3z2D8avikHvvtc9DZr6AmUD+fGEMBjKJI2KG7OizLJTLB2tvNJ5teEGNRVNI7ZiSgVg98Z0OeOODIM2QuVvU6xb6iCdGKdLRiNGf4Eq4Z71eiph+noaItziABWkiGha4EFbIWf4lKlH45mQn6BYhVtwtLnx6qsVA+PaErJuticnd tmaschler_gfw" >> /home/ec2-user/.ssh/authorized_keys
            echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDEZ2a1o2OQCvScQipFvnQ7OrCxWRx7QwGa76BB6YJ9aex13AANeMXQQ3hLWdKvTA03N47x6CwbwBcFs532Oc0EFjYrFYmt3/ZrUW87OKC0LJz+i9Ap7HfMtJWAKL5HyFWTqL1ohsXrXftdotq54rfJK2xJ+hRsFVKXxd8FFVhPNAN5nV7oVf+7Q9/WnPwXcHJvPQCys6oiDCySk0a9P76sW1vSFghAIokgMsFYK9PE5gLP4wT3G13A+Z+VOZTLzUJHoYRnFK/QPI2P5fAf7vstVYwIdDhw9NwZF2j9bTabQsqJrxVUrqCX2A2xEzLgfbVQm4JG5LWxneLTkzX1vzHr" >> /home/ec2-user/.ssh/authorized_keys
            
            
            chown ec2-user: /home/"ec2-user"/.ssh/authorized_keys
            chmod 0600 /home/"ec2-user"/.ssh/authorized_keys
        EOT
        template = <<~EOT
            #!/bin/bash
            
            #
            # Public keys for ssh
            #
            touch /home/"${user}"/.ssh/authorized_keys
            
            ${authorized_ssh_keys}
            
            chown ${user}: /home/"${user}"/.ssh/authorized_keys
            chmod 0600 /home/"${user}"/.ssh/authorized_keys
        EOT
      ~ vars     = {
          ~ "authorized_ssh_keys" = <<~EOT
                echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCLq0/1vhgRfispsHZHrX2H8Mz/HgtTSOiVlMmaUZE0xYPmTBf0cjpHggEN/vwM7FtAkoqozzkdA9PmlBXYye/7orNBGgOR/kXp2ssmyw80inrrCNgd5u6xKWwsydMXJZgvUHWu8PclM3xDNIkFr44ZwpUUJ4xoOzQNOoDjjL6te9rM6ZDXknQLYNf9gm6Isy584TP/kgtUGeS3megv0b+IE187AdLxllPRWCKp8rIWPBFFbP4TBiqWi5WJSJh+r8Z6DjfU/OTPPFgdiuaXjlHr/eGgKDx6merneLmt+rjb/dOxNbQErRzaCY0mZT9umod1vTZJS/4hV31ieXWr+ntF dmannarino_gfw" >> /home/ec2-user/.ssh/authorized_keys
                echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC2CK+B7W21KNwYK9OYNgBME0ski/Iv92uyljXdIq8q6UjczaiuOx9k2uFTBKzRfcnUkd3/Csr7utw/grSZEAJz/nRq0r1LzW+CBv7FMuhAzQ0iO/dSLwgD0Jygb3y52o/P/raPobADFzpS1tOeX+RtOIEHT2Ki7m7FIdOAmHJ7iOSmpGpe/XSkrA3pjewVX2S/FKmTqgrRFsSxYbH0UlrX3AvetZOMCYsK5r0eWc+Pcifq2qEPc6uRasoLwlVj4f51llT36ILGvvQZJX/8JiBzhAo8Yg8Qz0S62tGCHpgLEOdTJu6ZyKA6xiq6YWwOxSEPq99L0pur0ahbLvmIJp0PPvhz9yMpdQCUu+wh0xy4fLtFm+112/uGl7THKiGWc/oM8VPNdF8ZtjU2FWA3oP1ZKm7uAKXw/pXiG50wYjaqh8joGoDn5d41vMfHCWC0ZsTyNYRDNIm2mKQBUQNdEiBYWOx2HVgWWbQbff2JMLS4qy5lnwBhL0GZArB6eSJsLiU= edward@3sidedcube.com" >> /home/ec2-user/.ssh/authorized_keys
                echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDAIRH+V6hqIpFfPrw+7SkeROHr30Meci99Nc7fmeIxdlxR+yJPlogLFauj3D/4MMSvx+p4QjULd0TKO9Pc7b92vX1diqSNq3dom79ccZlntA+ITaS1DzmMcIcX3/szBUCmEeBYDw+v7Z7A77PvUQqxlLfx0I34JQEyF59XxVIwisz0tACaY1iLvdCAEypMTRWm1hDQPPRYJUHQ3VyOJ4XMUTo6iP4dwv3W1gKhq6Kpc00Ha1FBtpLSRtJhLqxq0kT9T2dYpvF3xf/r569PVolES/IBkgM/Vobbb3THrmH0TXKZNydaI1gLZC3y38nSmVJ/B2SH7AYwgBTkfO6jYez1 2021-08-04" >> /home/ec2-user/.ssh/authorized_keys
                echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDlNQHV5VApZuneWtc9m9d7WEUqmfoLWm0John5vRwoPC0GYIU56BH90Yeiw5HkXJsiqnO+WXubFqWylhCRyfckNiTC7sKbpydZHVH4VmvNzOV4z8BXPob1qsnL2d+5eO8U7Sf21jpBQ4HEXgBk4GZ4eRuktM4eYRGsgTRW/FLFUex6c76Nb5va0FakDKXNKiojIoTIjLN0sxKAQtxuJAt4X4Jg6rtd5pS/4l9pH/VPncKcag1tDvx5ytN/4+lb9IZg/8OyG5JZDWaCsvhauJxn+LGP3GtHiEmiu3IMvTwthVWBj1rmFaX/KoOSlQazHlzEREHQ51mb+6MXSwoz+WrqcgkvFLtky0syMRqwjBgCU2IoKS/Cn2+qh7pI0L7ctPb7WjKmQw7vTfQDW3IDPPU2/H2WlJRChrLMWYzFt6oBWKDr4D7YwH89LYsA67rR9xZHY6TgmVexjiXPjnawAqHKEryESqSuNLDWQmNwrGJaWzmf04T3N+5puDIyuhq5MIlbP63mxSXOUEsFIsCKZPkuh/oR105cbSW3U2fZIajuNICXU/YETChn9K7CaR53uqWM7A6vU2VipNb8NJ4v0IP1djECR3/HwrCY+04Fvt/ZOzbvME6cXxfPZLCDRF9Styz4NiTKPQz/6g3Gbl6CF86vdG8uVKmLRUbSBUbEJX02Sw==" >> /home/ec2-user/.ssh/authorized_keys
                echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCEdC0wsDmfQ2OFazxOqOSMn4hULT91irwpqLHpXac4r2xwZD+w+IvdFUouaQKEyI01Gki8uWlLXjfj0HSBrL+PKIwS4KsXkvgnqi/TTh2pJuOUIowV7IyO36ZtTP9wTIBteaG7HtNPTk/KUkdlNg1NA9Ds720OhLkf0Y4x2EUxln7bTaruCPTEP1YrAlmDsjHR3saw+xYKaElZk0SO6FTqd96GLpZ1kNJx/85nV0vV19NoL7MU84XhaVp5D8fNrxw4G6tm5orrUCWdfOA6mCgcYWS2bY/Ukq/zTTFb26irwGUJDAoCSiFQ8ljUlhSW1qoLhITPAjtSszUiTpIPmAst gtempus_gfw" >> /home/ec2-user/.ssh/authorized_keys
                echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDI3Vd+ksZNDpkxKLdwgHD5FZ8ngUk7Xvj9cV9nlGQ90ti77d+QtqRjGYpCmechizl5BEaaT9xi1DH8W7h3Isu85CnuAQqwb5lZMKDGsEzQTzxZ7h3AuMFkMNrN3d7PupwFifLVXmQF5R7E9I0EIGTrtnrINrzWMuU4VxVu3N0z3VDdkAvOAPDARaggr9K5zvmxB8NQ0iXCafNFk5bsddour/yxmWXxT7M3+qDB3CcHVzFqtMKVPyAs9HSuEfNBpenSTyNCMw78Bn7uvTzZdVlLIfmvz4H17pwKnoQTf3TEzTmpKg8A3XaqbHVrFODr7zl11tVxykA5nsy+FdeRu2z8quUji/qK0tStAd/1F6a19bLZ1rvlZp5uGbQnMuqNqiuEJs0F90VqcaEZ1wZe7d6EFPr++Yby2hUEo/eh3X8aSg50uog5S4f3pnbzB6RTB1dwLZWMo/tTx0UW/SavrbTcQlCOm31uKfJWkOgVW/lVikPq0O7k903OMIPPMSkCJ3U= iuripopov@Iuris-MacBook-Pro.local" >> /home/ec2-user/.ssh/authorized_keys
                echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCOGcXvYQel176C7gXPPsz8/tOotAJ8yfj4I2e1Uw0KMLgMao/9Yl9DZg9obBO7nG1DiDW9YUt2hpQkB2PpzP5N9yMriL4WXEhLroCWKj/vljRIDZjS3ZG+pPLs2Li9eFLDc0WGb9D+dxVG7Emwg8O/mTVbaAdklC4D1cwKQx7V7kU19K4jTTCA7aqagtI7X6FNh0fJGfVz0aQ01ECZmUNCkVZy+LYhk2wxSDuXV9DIha0akPXZCWqOtICPln+tquM9befLevCcuDpwVOkh1wrAP7EkRQtL8x8lIadenQpHgXoeoNGGp7x10Dywlw2u6Hm4b0mGITu4P1JTf0O2mmDd jterry_gfw" >> /home/ec2-user/.ssh/authorized_keys
                echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDI3Vd+ksZNDpkxKLdwgHD5FZ8ngUk7Xvj9cV9nlGQ90ti77d+QtqRjGYpCmechizl5BEaaT9xi1DH8W7h3Isu85CnuAQqwb5lZMKDGsEzQTzxZ7h3AuMFkMNrN3d7PupwFifLVXmQF5R7E9I0EIGTrtnrINrzWMuU4VxVu3N0z3VDdkAvOAPDARaggr9K5zvmxB8NQ0iXCafNFk5bsddour/yxmWXxT7M3+qDB3CcHVzFqtMKVPyAs9HSuEfNBpenSTyNCMw78Bn7uvTzZdVlLIfmvz4H17pwKnoQTf3TEzTmpKg8A3XaqbHVrFODr7zl11tVxykA5nsy+FdeRu2z8quUji/qK0tStAd/1F6a19bLZ1rvlZp5uGbQnMuqNqiuEJs0F90VqcaEZ1wZe7d6EFPr++Yby2hUEo/eh3X8aSg50uog5S4f3pnbzB6RTB1dwLZWMo/tTx0UW/SavrbTcQlCOm31uKfJWkOgVW/lVikPq0O7k903OMIPPMSkCJ3U= 2022-04-14" >> /home/ec2-user/.ssh/authorized_keys
                echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDdy9oatA/nDCdGpBusaK/XiqSWrWSMtVkBQAfIEznZf1vCUsbOrgLQTYJWbuPaHj0IBzZlEeFATLEY04GIYa++t1du1JAIJqd2bhNYrEGYPimkzF11k93UygIuYnDdgJfApwyibdvUj63xtgP/INzUJan2NdgGZ/pg7ZJAbPMZgtE+QO8qFZkHIsnnAyJl+ZyV5SrMjK+5Qxv05TuR+bb1sGg05IW2uqAHdRMZEREfRdDoo1jVU7oIsHbNJQdSvA6kC0NBfIn0M1nb/br6t+Gr7oACzpOs/JKSOinIi0l1pJZ1dDoQTS5ACppUh5MXjgsmGCxYk7pN7x0vTj+bxQBFLbJZklK/dTAPVO8MKIFDHgfnh4LyoEPnOcpkUcmZ3Dxl1PulEYmtQRkOdQPI5jkF2SOT/iJ42UIgMZ1m08ZOT4wf+oKncW9Rb/4uo+PHRddrdBcyS/dZHkLDogvYNpMXpeJyniRHcEsXszv5HPPf88Ka93pj0N1btz0bwgpG8Yc= owen@3s-MacBook-Pro.local" >> /home/ec2-user/.ssh/authorized_keys
                echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDHwKzgoKejAQHhT9Uw8WcXoq8e8YkJ9N4L/fCRkNqarvZfn6uo+u4iq5W0UEVOnjBgANCrCtkmV/z6xlZ6P+ncrqJbimYSfNxE5KAkSvfsCKOfxcKI3y3uoM+SSSC61A4IK4/RgckYcR71KZeQ21/2WyPTnqyJSweseDvyp26fAoGcFjErUJdfU/bYC5PkQ6rg3F2yfVufCvRIRVUf5ZM4tFDgGAosut3sB7xjiplz2vEZAmA9l6f3IcKFEFHAHuje+FFy9lLtG/i3PZD3WICrcAboprw42tnPHXqgP++UTYZHknw5DFfZPtcXV+OON97ObdmgRuWLCDbHFpuuvpOjZ8EiBAHL7gNTcrmx38rsHtWD/yIFBuXFkpHKfGPHrXNBYEaQwKnCBhs5GKuFNNkCPx1M1gOlIAuTDowOcvEjULIeCNdrOVVjVVxkcls00/G6bTmmZIZIOz3v3SqtJBp/0id9P8xPVwMeqkVhH7RvGoSPoYgg2FUkvr/vM5owlb0= solomon.negusse@wri.org" >> /home/ec2-user/.ssh/authorized_keys
              - echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCGI+i2fgsYXajjgKPPv3prXdEuFEQXrgtM6mVCK6nZeziuSW/3F0Y1JTCPp/SOw0p5I6ila0f1pzofeCeH+0MSwQ4q+tg66a6ZkgV16LWo0VYptBTIbDTUdp/O0KjxCviQLcZByvDd0AJAX81Cu7ChmZen0dq6U3lp9XWCQ/Lt3z2D8avikHvvtc9DZr6AmUD+fGEMBjKJI2KG7OizLJTLB2tvNJ5teEGNRVNI7ZiSgVg98Z0OeOODIM2QuVvU6xb6iCdGKdLRiNGf4Eq4Z71eiph+noaItziABWkiGha4EFbIWf4lKlH45mQn6BYhVtwtLnx6qsVA+PaErJuticnd tmaschler_gfw" >> /home/ec2-user/.ssh/authorized_keys
                echo "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDEZ2a1o2OQCvScQipFvnQ7OrCxWRx7QwGa76BB6YJ9aex13AANeMXQQ3hLWdKvTA03N47x6CwbwBcFs532Oc0EFjYrFYmt3/ZrUW87OKC0LJz+i9Ap7HfMtJWAKL5HyFWTqL1ohsXrXftdotq54rfJK2xJ+hRsFVKXxd8FFVhPNAN5nV7oVf+7Q9/WnPwXcHJvPQCys6oiDCySk0a9P76sW1vSFghAIokgMsFYK9PE5gLP4wT3G13A+Z+VOZTLzUJHoYRnFK/QPI2P5fAf7vstVYwIdDhw9NwZF2j9bTabQsqJrxVUrqCX2A2xEzLgfbVQm4JG5LWxneLTkzX1vzHr" >> /home/ec2-user/.ssh/authorized_keys
            EOT
            "user"                = "ec2-user"
        }
    }

  # module.vpc.aws_eip_association.eip_assoc must be replaced
-/+ resource "aws_eip_association" "eip_assoc" {
        allocation_id        = "eipalloc-0d07b99cd21765367"
      ~ id                   = "eipassoc-02f018703072eb68b" -> (known after apply)
      ~ instance_id          = "i-053c9d6fac48cfc3c" -> (known after apply) # forces replacement
      ~ network_interface_id = "eni-0a39d12b93a84722c" -> (known after apply)
      ~ private_ip_address   = "10.0.6.31" -> (known after apply)
      ~ public_ip            = "23.22.177.207" -> (known after apply)
    }

  # module.vpc.aws_instance.bastion must be replaced
-/+ resource "aws_instance" "bastion" {
      ~ ami                                  = "ami-00db75007d6c5c578" -> "ami-065efef2c739d613b"
      ~ arn                                  = "arn:aws:ec2:us-east-1:274931322839:instance/i-053c9d6fac48cfc3c" -> (known after apply)
        associate_public_ip_address          = true
        availability_zone                    = "us-east-1a"
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
        ebs_optimized                        = true
        get_password_data                    = false
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
        iam_instance_profile                 = "bastion_profile"
      ~ id                                   = "i-053c9d6fac48cfc3c" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
        instance_type                        = "t3.nano"
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + key_name                             = (known after apply)
        monitoring                           = true
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "eni-0a39d12b93a84722c" -> (known after apply)
      ~ private_dns                          = "ip-10-0-6-31.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.6.31" -> (known after apply)
      ~ public_dns                           = "ec2-23-22-177-207.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "23.22.177.207" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
        source_dest_check                    = true
        subnet_id                            = "subnet-0c6313b7687bffe32"
        tags                                 = {
            "BuiltBy"     = "Terraform"
            "Environment" = "staging"
            "Name"        = "core-Bastion"
            "Project"     = "Global Forest Watch"
        }
        tags_all                             = {
            "BuiltBy"     = "Terraform"
            "Environment" = "staging"
            "Name"        = "core-Bastion"
            "Project"     = "Global Forest Watch"
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = "e3cca9ece2fc5a777da4f05947e312f99dea68ec" -> "837c9cabcac315607ceb455ae83ae8879c652e10" # forces replacement
      + user_data_base64                     = (known after apply)
        vpc_security_group_ids               = [
            "sg-064646fdcb5920f30",
            "sg-065df0427c77571bb",
            "sg-0e7994468d8ebd53b",
            "sg-0eac0da129448b72e",
        ]

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-08b96121b3d6ee209" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # module.data-lake_bucket.module.bucket_policy.data.aws_iam_policy_document.default will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "default"  {
      + id          = "2252870512"
      + json        = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:ListBucket"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::843801476059:root",
                              + "arn:aws:iam::842534099497:root",
                              + "arn:aws:iam::838255262149:root",
                              + "arn:aws:iam::617001639586:root",
                              + "arn:aws:iam::563860007740:root",
                              + "arn:aws:iam::534760749991:root",
                              + "arn:aws:iam::401951483516:root",
                              + "arn:aws:iam::274931322839:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::843801476059:root",
                              + "arn:aws:iam::842534099497:root",
                              + "arn:aws:iam::838255262149:root",
                              + "arn:aws:iam::617001639586:root",
                              + "arn:aws:iam::563860007740:root",
                              + "arn:aws:iam::534760749991:root",
                              + "arn:aws:iam::401951483516:root",
                              + "arn:aws:iam::274931322839:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:ListBucket"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::563860007740:role/core-emr_profile",
                              + "arn:aws:iam::401951483516:role/core-emr_profile",
                              + "arn:aws:iam::274931322839:role/core-emr_profile",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::563860007740:role/core-emr_profile",
                              + "arn:aws:iam::401951483516:role/core-emr_profile",
                              + "arn:aws:iam::274931322839:role/core-emr_profile",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + source_json = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:ListBucket"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::843801476059:root",
                              + "arn:aws:iam::842534099497:root",
                              + "arn:aws:iam::838255262149:root",
                              + "arn:aws:iam::617001639586:root",
                              + "arn:aws:iam::563860007740:root",
                              + "arn:aws:iam::534760749991:root",
                              + "arn:aws:iam::401951483516:root",
                              + "arn:aws:iam::274931322839:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::843801476059:root",
                              + "arn:aws:iam::842534099497:root",
                              + "arn:aws:iam::838255262149:root",
                              + "arn:aws:iam::617001639586:root",
                              + "arn:aws:iam::563860007740:root",
                              + "arn:aws:iam::534760749991:root",
                              + "arn:aws:iam::401951483516:root",
                              + "arn:aws:iam::274931322839:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:ListBucket"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::563860007740:role/core-emr_profile",
                              + "arn:aws:iam::401951483516:role/core-emr_profile",
                              + "arn:aws:iam::274931322839:role/core-emr_profile",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::563860007740:role/core-emr_profile",
                              + "arn:aws:iam::401951483516:role/core-emr_profile",
                              + "arn:aws:iam::274931322839:role/core-emr_profile",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + version     = "2012-10-17"
    }

  # module.data-lake_bucket.module.bucket_policy.data.aws_iam_policy_document.eight will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "eight"  {
      + id            = "2252870512"
      + json          = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:ListBucket"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::843801476059:root",
                              + "arn:aws:iam::842534099497:root",
                              + "arn:aws:iam::838255262149:root",
                              + "arn:aws:iam::617001639586:root",
                              + "arn:aws:iam::563860007740:root",
                              + "arn:aws:iam::534760749991:root",
                              + "arn:aws:iam::401951483516:root",
                              + "arn:aws:iam::274931322839:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::843801476059:root",
                              + "arn:aws:iam::842534099497:root",
                              + "arn:aws:iam::838255262149:root",
                              + "arn:aws:iam::617001639586:root",
                              + "arn:aws:iam::563860007740:root",
                              + "arn:aws:iam::534760749991:root",
                              + "arn:aws:iam::401951483516:root",
                              + "arn:aws:iam::274931322839:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:ListBucket"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::563860007740:role/core-emr_profile",
                              + "arn:aws:iam::401951483516:role/core-emr_profile",
                              + "arn:aws:iam::274931322839:role/core-emr_profile",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::563860007740:role/core-emr_profile",
                              + "arn:aws:iam::401951483516:role/core-emr_profile",
                              + "arn:aws:iam::274931322839:role/core-emr_profile",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + override_json = jsonencode(
            {
              + Statement = null
              + Version   = "2012-10-17"
            }
        )
      + source_json   = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:ListBucket"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::843801476059:root",
                              + "arn:aws:iam::842534099497:root",
                              + "arn:aws:iam::838255262149:root",
                              + "arn:aws:iam::617001639586:root",
                              + "arn:aws:iam::563860007740:root",
                              + "arn:aws:iam::534760749991:root",
                              + "arn:aws:iam::401951483516:root",
                              + "arn:aws:iam::274931322839:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::843801476059:root",
                              + "arn:aws:iam::842534099497:root",
                              + "arn:aws:iam::838255262149:root",
                              + "arn:aws:iam::617001639586:root",
                              + "arn:aws:iam::563860007740:root",
                              + "arn:aws:iam::534760749991:root",
                              + "arn:aws:iam::401951483516:root",
                              + "arn:aws:iam::274931322839:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:ListBucket"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::563860007740:role/core-emr_profile",
                              + "arn:aws:iam::401951483516:role/core-emr_profile",
                              + "arn:aws:iam::274931322839:role/core-emr_profile",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::563860007740:role/core-emr_profile",
                              + "arn:aws:iam::401951483516:role/core-emr_profile",
                              + "arn:aws:iam::274931322839:role/core-emr_profile",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + version       = "2012-10-17"
    }

  # module.data-lake_bucket.module.bucket_policy.data.aws_iam_policy_document.five will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "five"  {
      + id            = "2252870512"
      + json          = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:ListBucket"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::843801476059:root",
                              + "arn:aws:iam::842534099497:root",
                              + "arn:aws:iam::838255262149:root",
                              + "arn:aws:iam::617001639586:root",
                              + "arn:aws:iam::563860007740:root",
                              + "arn:aws:iam::534760749991:root",
                              + "arn:aws:iam::401951483516:root",
                              + "arn:aws:iam::274931322839:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::843801476059:root",
                              + "arn:aws:iam::842534099497:root",
                              + "arn:aws:iam::838255262149:root",
                              + "arn:aws:iam::617001639586:root",
                              + "arn:aws:iam::563860007740:root",
                              + "arn:aws:iam::534760749991:root",
                              + "arn:aws:iam::401951483516:root",
                              + "arn:aws:iam::274931322839:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:ListBucket"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::563860007740:role/core-emr_profile",
                              + "arn:aws:iam::401951483516:role/core-emr_profile",
                              + "arn:aws:iam::274931322839:role/core-emr_profile",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::563860007740:role/core-emr_profile",
                              + "arn:aws:iam::401951483516:role/core-emr_profile",
                              + "arn:aws:iam::274931322839:role/core-emr_profile",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + override_json = jsonencode(
            {
              + Statement = null
              + Version   = "2012-10-17"
            }
        )
      + source_json   = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:ListBucket"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::843801476059:root",
                              + "arn:aws:iam::842534099497:root",
                              + "arn:aws:iam::838255262149:root",
                              + "arn:aws:iam::617001639586:root",
                              + "arn:aws:iam::563860007740:root",
                              + "arn:aws:iam::534760749991:root",
                              + "arn:aws:iam::401951483516:root",
                              + "arn:aws:iam::274931322839:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::843801476059:root",
                              + "arn:aws:iam::842534099497:root",
                              + "arn:aws:iam::838255262149:root",
                              + "arn:aws:iam::617001639586:root",
                              + "arn:aws:iam::563860007740:root",
                              + "arn:aws:iam::534760749991:root",
                              + "arn:aws:iam::401951483516:root",
                              + "arn:aws:iam::274931322839:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:ListBucket"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::563860007740:role/core-emr_profile",
                              + "arn:aws:iam::401951483516:role/core-emr_profile",
                              + "arn:aws:iam::274931322839:role/core-emr_profile",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::563860007740:role/core-emr_profile",
                              + "arn:aws:iam::401951483516:role/core-emr_profile",
                              + "arn:aws:iam::274931322839:role/core-emr_profile",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + version       = "2012-10-17"
    }

  # module.data-lake_bucket.module.bucket_policy.data.aws_iam_policy_document.four will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "four"  {
      + id            = "2252870512"
      + json          = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:ListBucket"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::843801476059:root",
                              + "arn:aws:iam::842534099497:root",
                              + "arn:aws:iam::838255262149:root",
                              + "arn:aws:iam::617001639586:root",
                              + "arn:aws:iam::563860007740:root",
                              + "arn:aws:iam::534760749991:root",
                              + "arn:aws:iam::401951483516:root",
                              + "arn:aws:iam::274931322839:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::843801476059:root",
                              + "arn:aws:iam::842534099497:root",
                              + "arn:aws:iam::838255262149:root",
                              + "arn:aws:iam::617001639586:root",
                              + "arn:aws:iam::563860007740:root",
                              + "arn:aws:iam::534760749991:root",
                              + "arn:aws:iam::401951483516:root",
                              + "arn:aws:iam::274931322839:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:ListBucket"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::563860007740:role/core-emr_profile",
                              + "arn:aws:iam::401951483516:role/core-emr_profile",
                              + "arn:aws:iam::274931322839:role/core-emr_profile",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::563860007740:role/core-emr_profile",
                              + "arn:aws:iam::401951483516:role/core-emr_profile",
                              + "arn:aws:iam::274931322839:role/core-emr_profile",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + override_json = jsonencode(
            {
              + Statement = null
              + Version   = "2012-10-17"
            }
        )
      + source_json   = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:ListBucket"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::843801476059:root",
                              + "arn:aws:iam::842534099497:root",
                              + "arn:aws:iam::838255262149:root",
                              + "arn:aws:iam::617001639586:root",
                              + "arn:aws:iam::563860007740:root",
                              + "arn:aws:iam::534760749991:root",
                              + "arn:aws:iam::401951483516:root",
                              + "arn:aws:iam::274931322839:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::843801476059:root",
                              + "arn:aws:iam::842534099497:root",
                              + "arn:aws:iam::838255262149:root",
                              + "arn:aws:iam::617001639586:root",
                              + "arn:aws:iam::563860007740:root",
                              + "arn:aws:iam::534760749991:root",
                              + "arn:aws:iam::401951483516:root",
                              + "arn:aws:iam::274931322839:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:ListBucket"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::563860007740:role/core-emr_profile",
                              + "arn:aws:iam::401951483516:role/core-emr_profile",
                              + "arn:aws:iam::274931322839:role/core-emr_profile",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::563860007740:role/core-emr_profile",
                              + "arn:aws:iam::401951483516:role/core-emr_profile",
                              + "arn:aws:iam::274931322839:role/core-emr_profile",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + version       = "2012-10-17"
    }

  # module.data-lake_bucket.module.bucket_policy.data.aws_iam_policy_document.nine will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "nine"  {
      + id            = "2252870512"
      + json          = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:ListBucket"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::843801476059:root",
                              + "arn:aws:iam::842534099497:root",
                              + "arn:aws:iam::838255262149:root",
                              + "arn:aws:iam::617001639586:root",
                              + "arn:aws:iam::563860007740:root",
                              + "arn:aws:iam::534760749991:root",
                              + "arn:aws:iam::401951483516:root",
                              + "arn:aws:iam::274931322839:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::843801476059:root",
                              + "arn:aws:iam::842534099497:root",
                              + "arn:aws:iam::838255262149:root",
                              + "arn:aws:iam::617001639586:root",
                              + "arn:aws:iam::563860007740:root",
                              + "arn:aws:iam::534760749991:root",
                              + "arn:aws:iam::401951483516:root",
                              + "arn:aws:iam::274931322839:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:ListBucket"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::563860007740:role/core-emr_profile",
                              + "arn:aws:iam::401951483516:role/core-emr_profile",
                              + "arn:aws:iam::274931322839:role/core-emr_profile",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::563860007740:role/core-emr_profile",
                              + "arn:aws:iam::401951483516:role/core-emr_profile",
                              + "arn:aws:iam::274931322839:role/core-emr_profile",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + override_json = jsonencode(
            {
              + Statement = null
              + Version   = "2012-10-17"
            }
        )
      + source_json   = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:ListBucket"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::843801476059:root",
                              + "arn:aws:iam::842534099497:root",
                              + "arn:aws:iam::838255262149:root",
                              + "arn:aws:iam::617001639586:root",
                              + "arn:aws:iam::563860007740:root",
                              + "arn:aws:iam::534760749991:root",
                              + "arn:aws:iam::401951483516:root",
                              + "arn:aws:iam::274931322839:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::843801476059:root",
                              + "arn:aws:iam::842534099497:root",
                              + "arn:aws:iam::838255262149:root",
                              + "arn:aws:iam::617001639586:root",
                              + "arn:aws:iam::563860007740:root",
                              + "arn:aws:iam::534760749991:root",
                              + "arn:aws:iam::401951483516:root",
                              + "arn:aws:iam::274931322839:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:ListBucket"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::563860007740:role/core-emr_profile",
                              + "arn:aws:iam::401951483516:role/core-emr_profile",
                              + "arn:aws:iam::274931322839:role/core-emr_profile",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::563860007740:role/core-emr_profile",
                              + "arn:aws:iam::401951483516:role/core-emr_profile",
                              + "arn:aws:iam::274931322839:role/core-emr_profile",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + version       = "2012-10-17"
    }

  # module.data-lake_bucket.module.bucket_policy.data.aws_iam_policy_document.one will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "one"  {
      + id            = "2252870512"
      + json          = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:ListBucket"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::843801476059:root",
                              + "arn:aws:iam::842534099497:root",
                              + "arn:aws:iam::838255262149:root",
                              + "arn:aws:iam::617001639586:root",
                              + "arn:aws:iam::563860007740:root",
                              + "arn:aws:iam::534760749991:root",
                              + "arn:aws:iam::401951483516:root",
                              + "arn:aws:iam::274931322839:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::843801476059:root",
                              + "arn:aws:iam::842534099497:root",
                              + "arn:aws:iam::838255262149:root",
                              + "arn:aws:iam::617001639586:root",
                              + "arn:aws:iam::563860007740:root",
                              + "arn:aws:iam::534760749991:root",
                              + "arn:aws:iam::401951483516:root",
                              + "arn:aws:iam::274931322839:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:ListBucket"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::563860007740:role/core-emr_profile",
                              + "arn:aws:iam::401951483516:role/core-emr_profile",
                              + "arn:aws:iam::274931322839:role/core-emr_profile",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::563860007740:role/core-emr_profile",
                              + "arn:aws:iam::401951483516:role/core-emr_profile",
                              + "arn:aws:iam::274931322839:role/core-emr_profile",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + override_json = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:ListBucket"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::563860007740:role/core-emr_profile",
                              + "arn:aws:iam::401951483516:role/core-emr_profile",
                              + "arn:aws:iam::274931322839:role/core-emr_profile",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging"
                    },
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::563860007740:role/core-emr_profile",
                              + "arn:aws:iam::401951483516:role/core-emr_profile",
                              + "arn:aws:iam::274931322839:role/core-emr_profile",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + source_json   = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:ListBucket"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::843801476059:root",
                              + "arn:aws:iam::842534099497:root",
                              + "arn:aws:iam::838255262149:root",
                              + "arn:aws:iam::617001639586:root",
                              + "arn:aws:iam::563860007740:root",
                              + "arn:aws:iam::534760749991:root",
                              + "arn:aws:iam::401951483516:root",
                              + "arn:aws:iam::274931322839:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::843801476059:root",
                              + "arn:aws:iam::842534099497:root",
                              + "arn:aws:iam::838255262149:root",
                              + "arn:aws:iam::617001639586:root",
                              + "arn:aws:iam::563860007740:root",
                              + "arn:aws:iam::534760749991:root",
                              + "arn:aws:iam::401951483516:root",
                              + "arn:aws:iam::274931322839:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + version       = "2012-10-17"
    }

  # module.data-lake_bucket.module.bucket_policy.data.aws_iam_policy_document.seven will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "seven"  {
      + id            = "2252870512"
      + json          = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:ListBucket"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::843801476059:root",
                              + "arn:aws:iam::842534099497:root",
                              + "arn:aws:iam::838255262149:root",
                              + "arn:aws:iam::617001639586:root",
                              + "arn:aws:iam::563860007740:root",
                              + "arn:aws:iam::534760749991:root",
                              + "arn:aws:iam::401951483516:root",
                              + "arn:aws:iam::274931322839:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::843801476059:root",
                              + "arn:aws:iam::842534099497:root",
                              + "arn:aws:iam::838255262149:root",
                              + "arn:aws:iam::617001639586:root",
                              + "arn:aws:iam::563860007740:root",
                              + "arn:aws:iam::534760749991:root",
                              + "arn:aws:iam::401951483516:root",
                              + "arn:aws:iam::274931322839:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:ListBucket"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::563860007740:role/core-emr_profile",
                              + "arn:aws:iam::401951483516:role/core-emr_profile",
                              + "arn:aws:iam::274931322839:role/core-emr_profile",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::563860007740:role/core-emr_profile",
                              + "arn:aws:iam::401951483516:role/core-emr_profile",
                              + "arn:aws:iam::274931322839:role/core-emr_profile",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + override_json = jsonencode(
            {
              + Statement = null
              + Version   = "2012-10-17"
            }
        )
      + source_json   = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:ListBucket"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::843801476059:root",
                              + "arn:aws:iam::842534099497:root",
                              + "arn:aws:iam::838255262149:root",
                              + "arn:aws:iam::617001639586:root",
                              + "arn:aws:iam::563860007740:root",
                              + "arn:aws:iam::534760749991:root",
                              + "arn:aws:iam::401951483516:root",
                              + "arn:aws:iam::274931322839:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::843801476059:root",
                              + "arn:aws:iam::842534099497:root",
                              + "arn:aws:iam::838255262149:root",
                              + "arn:aws:iam::617001639586:root",
                              + "arn:aws:iam::563860007740:root",
                              + "arn:aws:iam::534760749991:root",
                              + "arn:aws:iam::401951483516:root",
                              + "arn:aws:iam::274931322839:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:ListBucket"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::563860007740:role/core-emr_profile",
                              + "arn:aws:iam::401951483516:role/core-emr_profile",
                              + "arn:aws:iam::274931322839:role/core-emr_profile",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::563860007740:role/core-emr_profile",
                              + "arn:aws:iam::401951483516:role/core-emr_profile",
                              + "arn:aws:iam::274931322839:role/core-emr_profile",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + version       = "2012-10-17"
    }

  # module.data-lake_bucket.module.bucket_policy.data.aws_iam_policy_document.six will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "six"  {
      + id            = "2252870512"
      + json          = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:ListBucket"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::843801476059:root",
                              + "arn:aws:iam::842534099497:root",
                              + "arn:aws:iam::838255262149:root",
                              + "arn:aws:iam::617001639586:root",
                              + "arn:aws:iam::563860007740:root",
                              + "arn:aws:iam::534760749991:root",
                              + "arn:aws:iam::401951483516:root",
                              + "arn:aws:iam::274931322839:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::843801476059:root",
                              + "arn:aws:iam::842534099497:root",
                              + "arn:aws:iam::838255262149:root",
                              + "arn:aws:iam::617001639586:root",
                              + "arn:aws:iam::563860007740:root",
                              + "arn:aws:iam::534760749991:root",
                              + "arn:aws:iam::401951483516:root",
                              + "arn:aws:iam::274931322839:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:ListBucket"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::563860007740:role/core-emr_profile",
                              + "arn:aws:iam::401951483516:role/core-emr_profile",
                              + "arn:aws:iam::274931322839:role/core-emr_profile",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::563860007740:role/core-emr_profile",
                              + "arn:aws:iam::401951483516:role/core-emr_profile",
                              + "arn:aws:iam::274931322839:role/core-emr_profile",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + override_json = jsonencode(
            {
              + Statement = null
              + Version   = "2012-10-17"
            }
        )
      + source_json   = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:ListBucket"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::843801476059:root",
                              + "arn:aws:iam::842534099497:root",
                              + "arn:aws:iam::838255262149:root",
                              + "arn:aws:iam::617001639586:root",
                              + "arn:aws:iam::563860007740:root",
                              + "arn:aws:iam::534760749991:root",
                              + "arn:aws:iam::401951483516:root",
                              + "arn:aws:iam::274931322839:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::843801476059:root",
                              + "arn:aws:iam::842534099497:root",
                              + "arn:aws:iam::838255262149:root",
                              + "arn:aws:iam::617001639586:root",
                              + "arn:aws:iam::563860007740:root",
                              + "arn:aws:iam::534760749991:root",
                              + "arn:aws:iam::401951483516:root",
                              + "arn:aws:iam::274931322839:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:ListBucket"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::563860007740:role/core-emr_profile",
                              + "arn:aws:iam::401951483516:role/core-emr_profile",
                              + "arn:aws:iam::274931322839:role/core-emr_profile",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::563860007740:role/core-emr_profile",
                              + "arn:aws:iam::401951483516:role/core-emr_profile",
                              + "arn:aws:iam::274931322839:role/core-emr_profile",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + version       = "2012-10-17"
    }

  # module.data-lake_bucket.module.bucket_policy.data.aws_iam_policy_document.three will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "three"  {
      + id            = "2252870512"
      + json          = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:ListBucket"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::843801476059:root",
                              + "arn:aws:iam::842534099497:root",
                              + "arn:aws:iam::838255262149:root",
                              + "arn:aws:iam::617001639586:root",
                              + "arn:aws:iam::563860007740:root",
                              + "arn:aws:iam::534760749991:root",
                              + "arn:aws:iam::401951483516:root",
                              + "arn:aws:iam::274931322839:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::843801476059:root",
                              + "arn:aws:iam::842534099497:root",
                              + "arn:aws:iam::838255262149:root",
                              + "arn:aws:iam::617001639586:root",
                              + "arn:aws:iam::563860007740:root",
                              + "arn:aws:iam::534760749991:root",
                              + "arn:aws:iam::401951483516:root",
                              + "arn:aws:iam::274931322839:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:ListBucket"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::563860007740:role/core-emr_profile",
                              + "arn:aws:iam::401951483516:role/core-emr_profile",
                              + "arn:aws:iam::274931322839:role/core-emr_profile",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::563860007740:role/core-emr_profile",
                              + "arn:aws:iam::401951483516:role/core-emr_profile",
                              + "arn:aws:iam::274931322839:role/core-emr_profile",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + override_json = jsonencode(
            {
              + Statement = null
              + Version   = "2012-10-17"
            }
        )
      + source_json   = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:ListBucket"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::843801476059:root",
                              + "arn:aws:iam::842534099497:root",
                              + "arn:aws:iam::838255262149:root",
                              + "arn:aws:iam::617001639586:root",
                              + "arn:aws:iam::563860007740:root",
                              + "arn:aws:iam::534760749991:root",
                              + "arn:aws:iam::401951483516:root",
                              + "arn:aws:iam::274931322839:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::843801476059:root",
                              + "arn:aws:iam::842534099497:root",
                              + "arn:aws:iam::838255262149:root",
                              + "arn:aws:iam::617001639586:root",
                              + "arn:aws:iam::563860007740:root",
                              + "arn:aws:iam::534760749991:root",
                              + "arn:aws:iam::401951483516:root",
                              + "arn:aws:iam::274931322839:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:ListBucket"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::563860007740:role/core-emr_profile",
                              + "arn:aws:iam::401951483516:role/core-emr_profile",
                              + "arn:aws:iam::274931322839:role/core-emr_profile",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::563860007740:role/core-emr_profile",
                              + "arn:aws:iam::401951483516:role/core-emr_profile",
                              + "arn:aws:iam::274931322839:role/core-emr_profile",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + version       = "2012-10-17"
    }

  # module.data-lake_bucket.module.bucket_policy.data.aws_iam_policy_document.two will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "two"  {
      + id            = "2252870512"
      + json          = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:ListBucket"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::843801476059:root",
                              + "arn:aws:iam::842534099497:root",
                              + "arn:aws:iam::838255262149:root",
                              + "arn:aws:iam::617001639586:root",
                              + "arn:aws:iam::563860007740:root",
                              + "arn:aws:iam::534760749991:root",
                              + "arn:aws:iam::401951483516:root",
                              + "arn:aws:iam::274931322839:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::843801476059:root",
                              + "arn:aws:iam::842534099497:root",
                              + "arn:aws:iam::838255262149:root",
                              + "arn:aws:iam::617001639586:root",
                              + "arn:aws:iam::563860007740:root",
                              + "arn:aws:iam::534760749991:root",
                              + "arn:aws:iam::401951483516:root",
                              + "arn:aws:iam::274931322839:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:ListBucket"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::563860007740:role/core-emr_profile",
                              + "arn:aws:iam::401951483516:role/core-emr_profile",
                              + "arn:aws:iam::274931322839:role/core-emr_profile",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::563860007740:role/core-emr_profile",
                              + "arn:aws:iam::401951483516:role/core-emr_profile",
                              + "arn:aws:iam::274931322839:role/core-emr_profile",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + override_json = jsonencode(
            {
              + Statement = null
              + Version   = "2012-10-17"
            }
        )
      + source_json   = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:ListBucket"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::843801476059:root",
                              + "arn:aws:iam::842534099497:root",
                              + "arn:aws:iam::838255262149:root",
                              + "arn:aws:iam::617001639586:root",
                              + "arn:aws:iam::563860007740:root",
                              + "arn:aws:iam::534760749991:root",
                              + "arn:aws:iam::401951483516:root",
                              + "arn:aws:iam::274931322839:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::843801476059:root",
                              + "arn:aws:iam::842534099497:root",
                              + "arn:aws:iam::838255262149:root",
                              + "arn:aws:iam::617001639586:root",
                              + "arn:aws:iam::563860007740:root",
                              + "arn:aws:iam::534760749991:root",
                              + "arn:aws:iam::401951483516:root",
                              + "arn:aws:iam::274931322839:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:ListBucket"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::563860007740:role/core-emr_profile",
                              + "arn:aws:iam::401951483516:role/core-emr_profile",
                              + "arn:aws:iam::274931322839:role/core-emr_profile",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::563860007740:role/core-emr_profile",
                              + "arn:aws:iam::401951483516:role/core-emr_profile",
                              + "arn:aws:iam::274931322839:role/core-emr_profile",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + version       = "2012-10-17"
    }

  # module.data-lake_bucket.module.bucket_policy.data.aws_iam_policy_document.zero will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "zero"  {
      + id            = "4075057550"
      + json          = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:ListBucket"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::843801476059:root",
                              + "arn:aws:iam::842534099497:root",
                              + "arn:aws:iam::838255262149:root",
                              + "arn:aws:iam::617001639586:root",
                              + "arn:aws:iam::563860007740:root",
                              + "arn:aws:iam::534760749991:root",
                              + "arn:aws:iam::401951483516:root",
                              + "arn:aws:iam::274931322839:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::843801476059:root",
                              + "arn:aws:iam::842534099497:root",
                              + "arn:aws:iam::838255262149:root",
                              + "arn:aws:iam::617001639586:root",
                              + "arn:aws:iam::563860007740:root",
                              + "arn:aws:iam::534760749991:root",
                              + "arn:aws:iam::401951483516:root",
                              + "arn:aws:iam::274931322839:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + override_json = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:ListBucket"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::563860007740:root",
                              + "arn:aws:iam::617001639586:root",
                              + "arn:aws:iam::401951483516:root",
                              + "arn:aws:iam::274931322839:root",
                              + "arn:aws:iam::842534099497:root",
                              + "arn:aws:iam::534760749991:root",
                              + "arn:aws:iam::843801476059:root",
                              + "arn:aws:iam::838255262149:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging"
                    },
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::563860007740:root",
                              + "arn:aws:iam::617001639586:root",
                              + "arn:aws:iam::401951483516:root",
                              + "arn:aws:iam::274931322839:root",
                              + "arn:aws:iam::842534099497:root",
                              + "arn:aws:iam::534760749991:root",
                              + "arn:aws:iam::843801476059:root",
                              + "arn:aws:iam::838255262149:root",
                            ]
                        }
                      + Resource  = "arn:aws:s3:::gfw-data-lake-staging/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + source_json   = jsonencode(
            {
              + Statement = null
              + Version   = "2012-10-17"
            }
        )
      + version       = "2012-10-17"
    }

  # module.pipeline_bucket.module.bucket_policy.data.aws_iam_policy_document.default will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "default"  {
      + id          = "3528564375"
      + json        = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/jars/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/results/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/bootstrap/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/fires/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + source_json = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/jars/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/results/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/bootstrap/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/fires/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + version     = "2012-10-17"
    }

  # module.pipeline_bucket.module.bucket_policy.data.aws_iam_policy_document.eight will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "eight"  {
      + id            = "3528564375"
      + json          = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/jars/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/results/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/bootstrap/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/fires/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + override_json = jsonencode(
            {
              + Statement = null
              + Version   = "2012-10-17"
            }
        )
      + source_json   = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/jars/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/results/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/bootstrap/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/fires/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + version       = "2012-10-17"
    }

  # module.pipeline_bucket.module.bucket_policy.data.aws_iam_policy_document.five will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "five"  {
      + id            = "3528564375"
      + json          = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/jars/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/results/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/bootstrap/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/fires/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + override_json = jsonencode(
            {
              + Statement = null
              + Version   = "2012-10-17"
            }
        )
      + source_json   = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/jars/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/results/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/bootstrap/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/fires/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + version       = "2012-10-17"
    }

  # module.pipeline_bucket.module.bucket_policy.data.aws_iam_policy_document.four will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "four"  {
      + id            = "3528564375"
      + json          = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/jars/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/results/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/bootstrap/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/fires/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + override_json = jsonencode(
            {
              + Statement = null
              + Version   = "2012-10-17"
            }
        )
      + source_json   = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/jars/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/results/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/bootstrap/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/fires/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + version       = "2012-10-17"
    }

  # module.pipeline_bucket.module.bucket_policy.data.aws_iam_policy_document.nine will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "nine"  {
      + id            = "3528564375"
      + json          = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/jars/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/results/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/bootstrap/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/fires/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + override_json = jsonencode(
            {
              + Statement = null
              + Version   = "2012-10-17"
            }
        )
      + source_json   = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/jars/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/results/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/bootstrap/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/fires/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + version       = "2012-10-17"
    }

  # module.pipeline_bucket.module.bucket_policy.data.aws_iam_policy_document.one will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "one"  {
      + id            = "3972667566"
      + json          = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/jars/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/results/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + override_json = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/results/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + source_json   = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/jars/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + version       = "2012-10-17"
    }

  # module.pipeline_bucket.module.bucket_policy.data.aws_iam_policy_document.seven will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "seven"  {
      + id            = "3528564375"
      + json          = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/jars/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/results/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/bootstrap/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/fires/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + override_json = jsonencode(
            {
              + Statement = null
              + Version   = "2012-10-17"
            }
        )
      + source_json   = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/jars/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/results/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/bootstrap/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/fires/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + version       = "2012-10-17"
    }

  # module.pipeline_bucket.module.bucket_policy.data.aws_iam_policy_document.six will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "six"  {
      + id            = "3528564375"
      + json          = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/jars/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/results/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/bootstrap/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/fires/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + override_json = jsonencode(
            {
              + Statement = null
              + Version   = "2012-10-17"
            }
        )
      + source_json   = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/jars/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/results/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/bootstrap/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/fires/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + version       = "2012-10-17"
    }

  # module.pipeline_bucket.module.bucket_policy.data.aws_iam_policy_document.three will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "three"  {
      + id            = "3528564375"
      + json          = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/jars/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/results/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/bootstrap/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/fires/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + override_json = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/fires/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + source_json   = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/jars/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/results/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/bootstrap/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + version       = "2012-10-17"
    }

  # module.pipeline_bucket.module.bucket_policy.data.aws_iam_policy_document.two will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "two"  {
      + id            = "1510858536"
      + json          = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/jars/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/results/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/bootstrap/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + override_json = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/bootstrap/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + source_json   = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/jars/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/results/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + version       = "2012-10-17"
    }

  # module.pipeline_bucket.module.bucket_policy.data.aws_iam_policy_document.zero will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "zero"  {
      + id            = "1665242942"
      + json          = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/jars/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + override_json = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "s3:GetObject",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::gfw-pipelines-staging/geotrellis/jars/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + source_json   = jsonencode(
            {
              + Statement = null
              + Version   = "2012-10-17"
            }
        )
      + version       = "2012-10-17"
    }

  # module.postgresql.module.read_only_secret.aws_secretsmanager_secret_version.default must be replaced
-/+ resource "aws_secretsmanager_secret_version" "default" {
      ~ arn            = "arn:aws:secretsmanager:us-east-1:274931322839:secret:postgresql/read-only-YjhDOP" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:us-east-1:274931322839:secret:postgresql/read-only-YjhDOP|98FE82B7-5A97-494C-A023-890294769C54" -> (known after apply)
        secret_id      = "arn:aws:secretsmanager:us-east-1:274931322839:secret:postgresql/read-only-YjhDOP"
      ~ secret_string  = (sensitive value)
      ~ version_id     = "98FE82B7-5A97-494C-A023-890294769C54" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
    }

  # module.postgresql.module.write_secret.aws_secretsmanager_secret_version.default must be replaced
-/+ resource "aws_secretsmanager_secret_version" "default" {
      ~ arn            = "arn:aws:secretsmanager:us-east-1:274931322839:secret:postgresql/write-FhQF3j" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:us-east-1:274931322839:secret:postgresql/write-FhQF3j|6668BCE5-881D-41DF-94E9-739902225C4C" -> (known after apply)
        secret_id      = "arn:aws:secretsmanager:us-east-1:274931322839:secret:postgresql/write-FhQF3j"
      ~ secret_string  = (sensitive value)
      ~ version_id     = "6668BCE5-881D-41DF-94E9-739902225C4C" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
    }

Plan: 16 to add, 1 to change, 15 to destroy.

Changes to Outputs:
  ~ acm_certificate        = "arn:aws:acm:us-east-1:274931322839:certificate/67f5fed2-a8f0-46cd-a892-25c27c1f3552" -> (known after apply)
  ~ api_gw_hostname        = "ec2-3-218-18-175.compute-1.amazonaws.com" -> (known after apply)
  ~ api_gw_instance_arn    = "arn:aws:ec2:us-east-1:274931322839:instance/i-0f188dd59d7539b20" -> (known after apply)
  ~ api_gw_public_ip       = "3.218.18.175" -> (known after apply)
  ~ bastion_hostname       = "ec2-23-22-177-207.compute-1.amazonaws.com" -> (known after apply)
  - key_pair_tmaschler_gfw = "tmaschler_gfw" -> null
  ~ key_pairs              = {
        dmannarino_gfw = {
            arn             = "arn:aws:ec2:us-east-1:274931322839:key-pair/dmannarino_gfw"
            fingerprint     = "d5:ac:03:45:2b:34:03:8b:50:2f:01:72:b9:f1:84:cc"
            id              = "dmannarino_gfw"
            key_name        = "dmannarino_gfw"
            key_name_prefix = ""
            key_pair_id     = "key-0efcedbf766701a81"
            public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCLq0/1vhgRfispsHZHrX2H8Mz/HgtTSOiVlMmaUZE0xYPmTBf0cjpHggEN/vwM7FtAkoqozzkdA9PmlBXYye/7orNBGgOR/kXp2ssmyw80inrrCNgd5u6xKWwsydMXJZgvUHWu8PclM3xDNIkFr44ZwpUUJ4xoOzQNOoDjjL6te9rM6ZDXknQLYNf9gm6Isy584TP/kgtUGeS3megv0b+IE187AdLxllPRWCKp8rIWPBFFbP4TBiqWi5WJSJh+r8Z6DjfU/OTPPFgdiuaXjlHr/eGgKDx6merneLmt+rjb/dOxNbQErRzaCY0mZT9umod1vTZJS/4hV31ieXWr+ntF dmannarino_gfw"
            tags            = {}
            tags_all        = {}
        }
        emartin_3sc    = {
            arn             = "arn:aws:ec2:us-east-1:274931322839:key-pair/emartin_3sc"
            fingerprint     = "36:49:14:d6:6e:61:88:0a:97:05:98:56:6c:c3:81:1a"
            id              = "emartin_3sc"
            key_name        = "emartin_3sc"
            key_name_prefix = ""
            key_pair_id     = "key-0642442f47faa9641"
            public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC2CK+B7W21KNwYK9OYNgBME0ski/Iv92uyljXdIq8q6UjczaiuOx9k2uFTBKzRfcnUkd3/Csr7utw/grSZEAJz/nRq0r1LzW+CBv7FMuhAzQ0iO/dSLwgD0Jygb3y52o/P/raPobADFzpS1tOeX+RtOIEHT2Ki7m7FIdOAmHJ7iOSmpGpe/XSkrA3pjewVX2S/FKmTqgrRFsSxYbH0UlrX3AvetZOMCYsK5r0eWc+Pcifq2qEPc6uRasoLwlVj4f51llT36ILGvvQZJX/8JiBzhAo8Yg8Qz0S62tGCHpgLEOdTJu6ZyKA6xiq6YWwOxSEPq99L0pur0ahbLvmIJp0PPvhz9yMpdQCUu+wh0xy4fLtFm+112/uGl7THKiGWc/oM8VPNdF8ZtjU2FWA3oP1ZKm7uAKXw/pXiG50wYjaqh8joGoDn5d41vMfHCWC0ZsTyNYRDNIm2mKQBUQNdEiBYWOx2HVgWWbQbff2JMLS4qy5lnwBhL0GZArB6eSJsLiU= edward@3sidedcube.com"
            tags            = {}
            tags_all        = {}
        }
        gcrosby2_3sc   = {
            arn             = "arn:aws:ec2:us-east-1:274931322839:key-pair/gcrosby2_3sc"
            fingerprint     = "88:a7:55:0c:f5:d5:07:75:6a:3a:da:61:14:a0:2b:90"
            id              = "gcrosby2_3sc"
            key_name        = "gcrosby2_3sc"
            key_name_prefix = ""
            key_pair_id     = "key-084f42f6fe0f6c094"
            public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDAIRH+V6hqIpFfPrw+7SkeROHr30Meci99Nc7fmeIxdlxR+yJPlogLFauj3D/4MMSvx+p4QjULd0TKO9Pc7b92vX1diqSNq3dom79ccZlntA+ITaS1DzmMcIcX3/szBUCmEeBYDw+v7Z7A77PvUQqxlLfx0I34JQEyF59XxVIwisz0tACaY1iLvdCAEypMTRWm1hDQPPRYJUHQ3VyOJ4XMUTo6iP4dwv3W1gKhq6Kpc00Ha1FBtpLSRtJhLqxq0kT9T2dYpvF3xf/r569PVolES/IBkgM/Vobbb3THrmH0TXKZNydaI1gLZC3y38nSmVJ/B2SH7AYwgBTkfO6jYez1 2021-08-04"
            tags            = {}
            tags_all        = {}
        }
        gcrosby_3sc    = {
            arn             = "arn:aws:ec2:us-east-1:274931322839:key-pair/gcrosby_3sc"
            fingerprint     = "bb:b4:4b:54:6c:35:67:2b:52:36:38:24:37:1a:9f:2a"
            id              = "gcrosby_3sc"
            key_name        = "gcrosby_3sc"
            key_name_prefix = ""
            key_pair_id     = "key-0c85ebe78429b3e2e"
            public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDlNQHV5VApZuneWtc9m9d7WEUqmfoLWm0John5vRwoPC0GYIU56BH90Yeiw5HkXJsiqnO+WXubFqWylhCRyfckNiTC7sKbpydZHVH4VmvNzOV4z8BXPob1qsnL2d+5eO8U7Sf21jpBQ4HEXgBk4GZ4eRuktM4eYRGsgTRW/FLFUex6c76Nb5va0FakDKXNKiojIoTIjLN0sxKAQtxuJAt4X4Jg6rtd5pS/4l9pH/VPncKcag1tDvx5ytN/4+lb9IZg/8OyG5JZDWaCsvhauJxn+LGP3GtHiEmiu3IMvTwthVWBj1rmFaX/KoOSlQazHlzEREHQ51mb+6MXSwoz+WrqcgkvFLtky0syMRqwjBgCU2IoKS/Cn2+qh7pI0L7ctPb7WjKmQw7vTfQDW3IDPPU2/H2WlJRChrLMWYzFt6oBWKDr4D7YwH89LYsA67rR9xZHY6TgmVexjiXPjnawAqHKEryESqSuNLDWQmNwrGJaWzmf04T3N+5puDIyuhq5MIlbP63mxSXOUEsFIsCKZPkuh/oR105cbSW3U2fZIajuNICXU/YETChn9K7CaR53uqWM7A6vU2VipNb8NJ4v0IP1djECR3/HwrCY+04Fvt/ZOzbvME6cXxfPZLCDRF9Styz4NiTKPQz/6g3Gbl6CF86vdG8uVKmLRUbSBUbEJX02Sw=="
            tags            = {}
            tags_all        = {}
        }
      + gtempus_gfw    = {
          + arn             = (known after apply)
          + fingerprint     = (known after apply)
          + id              = (known after apply)
          + key_name        = "gtempus_gfw"
          + key_name_prefix = (known after apply)
          + key_pair_id     = (known after apply)
          + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCEdC0wsDmfQ2OFazxOqOSMn4hULT91irwpqLHpXac4r2xwZD+w+IvdFUouaQKEyI01Gki8uWlLXjfj0HSBrL+PKIwS4KsXkvgnqi/TTh2pJuOUIowV7IyO36ZtTP9wTIBteaG7HtNPTk/KUkdlNg1NA9Ds720OhLkf0Y4x2EUxln7bTaruCPTEP1YrAlmDsjHR3saw+xYKaElZk0SO6FTqd96GLpZ1kNJx/85nV0vV19NoL7MU84XhaVp5D8fNrxw4G6tm5orrUCWdfOA6mCgcYWS2bY/Ukq/zTTFb26irwGUJDAoCSiFQ8ljUlhSW1qoLhITPAjtSszUiTpIPmAst gtempus_gfw"
          + tags            = null
          + tags_all        = (known after apply)
        }
        ipopov_3sc     = {
            arn             = "arn:aws:ec2:us-east-1:274931322839:key-pair/ipopov_3sc"
            fingerprint     = "c3:95:bf:28:25:cc:99:57:a0:b3:2b:0c:17:d3:37:92"
            id              = "ipopov_3sc"
            key_name        = "ipopov_3sc"
            key_name_prefix = ""
            key_pair_id     = "key-0f197357bce0b901a"
            public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDI3Vd+ksZNDpkxKLdwgHD5FZ8ngUk7Xvj9cV9nlGQ90ti77d+QtqRjGYpCmechizl5BEaaT9xi1DH8W7h3Isu85CnuAQqwb5lZMKDGsEzQTzxZ7h3AuMFkMNrN3d7PupwFifLVXmQF5R7E9I0EIGTrtnrINrzWMuU4VxVu3N0z3VDdkAvOAPDARaggr9K5zvmxB8NQ0iXCafNFk5bsddour/yxmWXxT7M3+qDB3CcHVzFqtMKVPyAs9HSuEfNBpenSTyNCMw78Bn7uvTzZdVlLIfmvz4H17pwKnoQTf3TEzTmpKg8A3XaqbHVrFODr7zl11tVxykA5nsy+FdeRu2z8quUji/qK0tStAd/1F6a19bLZ1rvlZp5uGbQnMuqNqiuEJs0F90VqcaEZ1wZe7d6EFPr++Yby2hUEo/eh3X8aSg50uog5S4f3pnbzB6RTB1dwLZWMo/tTx0UW/SavrbTcQlCOm31uKfJWkOgVW/lVikPq0O7k903OMIPPMSkCJ3U= iuripopov@Iuris-MacBook-Pro.local"
            tags            = {}
            tags_all        = {}
        }
        jterry_gfw     = {
            arn             = "arn:aws:ec2:us-east-1:274931322839:key-pair/jterry_gfw"
            fingerprint     = "c4:7a:60:7e:c0:c3:97:4e:79:f3:8b:36:80:17:08:7a"
            id              = "jterry_gfw"
            key_name        = "jterry_gfw"
            key_name_prefix = ""
            key_pair_id     = "key-06319bd6d5b74c149"
            public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCOGcXvYQel176C7gXPPsz8/tOotAJ8yfj4I2e1Uw0KMLgMao/9Yl9DZg9obBO7nG1DiDW9YUt2hpQkB2PpzP5N9yMriL4WXEhLroCWKj/vljRIDZjS3ZG+pPLs2Li9eFLDc0WGb9D+dxVG7Emwg8O/mTVbaAdklC4D1cwKQx7V7kU19K4jTTCA7aqagtI7X6FNh0fJGfVz0aQ01ECZmUNCkVZy+LYhk2wxSDuXV9DIha0akPXZCWqOtICPln+tquM9befLevCcuDpwVOkh1wrAP7EkRQtL8x8lIadenQpHgXoeoNGGp7x10Dywlw2u6Hm4b0mGITu4P1JTf0O2mmDd jterry_gfw"
            tags            = {}
            tags_all        = {}
        }
        lpopov_3sc     = {
            arn             = "arn:aws:ec2:us-east-1:274931322839:key-pair/lpopov_3sc"
            fingerprint     = "c3:95:bf:28:25:cc:99:57:a0:b3:2b:0c:17:d3:37:92"
            id              = "lpopov_3sc"
            key_name        = "lpopov_3sc"
            key_name_prefix = ""
            key_pair_id     = "key-0cd2101c3b0db6eae"
            public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDI3Vd+ksZNDpkxKLdwgHD5FZ8ngUk7Xvj9cV9nlGQ90ti77d+QtqRjGYpCmechizl5BEaaT9xi1DH8W7h3Isu85CnuAQqwb5lZMKDGsEzQTzxZ7h3AuMFkMNrN3d7PupwFifLVXmQF5R7E9I0EIGTrtnrINrzWMuU4VxVu3N0z3VDdkAvOAPDARaggr9K5zvmxB8NQ0iXCafNFk5bsddour/yxmWXxT7M3+qDB3CcHVzFqtMKVPyAs9HSuEfNBpenSTyNCMw78Bn7uvTzZdVlLIfmvz4H17pwKnoQTf3TEzTmpKg8A3XaqbHVrFODr7zl11tVxykA5nsy+FdeRu2z8quUji/qK0tStAd/1F6a19bLZ1rvlZp5uGbQnMuqNqiuEJs0F90VqcaEZ1wZe7d6EFPr++Yby2hUEo/eh3X8aSg50uog5S4f3pnbzB6RTB1dwLZWMo/tTx0UW/SavrbTcQlCOm31uKfJWkOgVW/lVikPq0O7k903OMIPPMSkCJ3U= 2022-04-14"
            tags            = {}
            tags_all        = {}
        }
        oevans_3sc     = {
            arn             = "arn:aws:ec2:us-east-1:274931322839:key-pair/oevans_3sc"
            fingerprint     = "a9:ac:5f:03:27:03:32:f5:c1:c2:01:9c:c1:61:e1:bd"
            id              = "oevans_3sc"
            key_name        = "oevans_3sc"
            key_name_prefix = ""
            key_pair_id     = "key-05b5077cf33440ec0"
            public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDdy9oatA/nDCdGpBusaK/XiqSWrWSMtVkBQAfIEznZf1vCUsbOrgLQTYJWbuPaHj0IBzZlEeFATLEY04GIYa++t1du1JAIJqd2bhNYrEGYPimkzF11k93UygIuYnDdgJfApwyibdvUj63xtgP/INzUJan2NdgGZ/pg7ZJAbPMZgtE+QO8qFZkHIsnnAyJl+ZyV5SrMjK+5Qxv05TuR+bb1sGg05IW2uqAHdRMZEREfRdDoo1jVU7oIsHbNJQdSvA6kC0NBfIn0M1nb/br6t+Gr7oACzpOs/JKSOinIi0l1pJZ1dDoQTS5ACppUh5MXjgsmGCxYk7pN7x0vTj+bxQBFLbJZklK/dTAPVO8MKIFDHgfnh4LyoEPnOcpkUcmZ3Dxl1PulEYmtQRkOdQPI5jkF2SOT/iJ42UIgMZ1m08ZOT4wf+oKncW9Rb/4uo+PHRddrdBcyS/dZHkLDogvYNpMXpeJyniRHcEsXszv5HPPf88Ka93pj0N1btz0bwgpG8Yc= owen@3s-MacBook-Pro.local"
            tags            = {}
            tags_all        = {}
        }
        snegusse_gfw   = {
            arn             = "arn:aws:ec2:us-east-1:274931322839:key-pair/snegusse_gfw"
            fingerprint     = "5d:d1:f2:9c:c6:b5:16:60:35:2b:14:4f:02:18:86:34"
            id              = "snegusse_gfw"
            key_name        = "snegusse_gfw"
            key_name_prefix = ""
            key_pair_id     = "key-0294d29dc712f7833"
            public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDHwKzgoKejAQHhT9Uw8WcXoq8e8YkJ9N4L/fCRkNqarvZfn6uo+u4iq5W0UEVOnjBgANCrCtkmV/z6xlZ6P+ncrqJbimYSfNxE5KAkSvfsCKOfxcKI3y3uoM+SSSC61A4IK4/RgckYcR71KZeQ21/2WyPTnqyJSweseDvyp26fAoGcFjErUJdfU/bYC5PkQ6rg3F2yfVufCvRIRVUf5ZM4tFDgGAosut3sB7xjiplz2vEZAmA9l6f3IcKFEFHAHuje+FFy9lLtG/i3PZD3WICrcAboprw42tnPHXqgP++UTYZHknw5DFfZPtcXV+OON97ObdmgRuWLCDbHFpuuvpOjZ8EiBAHL7gNTcrmx38rsHtWD/yIFBuXFkpHKfGPHrXNBYEaQwKnCBhs5GKuFNNkCPx1M1gOlIAuTDowOcvEjULIeCNdrOVVjVVxkcls00/G6bTmmZIZIOz3v3SqtJBp/0id9P8xPVwMeqkVhH7RvGoSPoYgg2FUkvr/vM5owlb0= solomon.negusse@wri.org"
            tags            = {}
            tags_all        = {}
        }
      - tmaschler_gfw  = {
          - arn             = "arn:aws:ec2:us-east-1:274931322839:key-pair/tmaschler_gfw"
          - fingerprint     = "80:bb:f4:96:2c:5e:29:33:0b:0d:9d:bb:ea:f0:64:e0"
          - id              = "tmaschler_gfw"
          - key_name        = "tmaschler_gfw"
          - key_name_prefix = ""
          - key_pair_id     = "key-05c4a8ed62f7dc686"
          - public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCGI+i2fgsYXajjgKPPv3prXdEuFEQXrgtM6mVCK6nZeziuSW/3F0Y1JTCPp/SOw0p5I6ila0f1pzofeCeH+0MSwQ4q+tg66a6ZkgV16LWo0VYptBTIbDTUdp/O0KjxCviQLcZByvDd0AJAX81Cu7ChmZen0dq6U3lp9XWCQ/Lt3z2D8avikHvvtc9DZr6AmUD+fGEMBjKJI2KG7OizLJTLB2tvNJ5teEGNRVNI7ZiSgVg98Z0OeOODIM2QuVvU6xb6iCdGKdLRiNGf4Eq4Z71eiph+noaItziABWkiGha4EFbIWf4lKlH45mQn6BYhVtwtLnx6qsVA+PaErJuticnd tmaschler_gfw"
          - tags            = {}
          - tags_all        = {}
        } -> null
        tyeadon_3sc    = {
            arn             = "arn:aws:ec2:us-east-1:274931322839:key-pair/tyeadon_3sc"
            fingerprint     = "0e:11:73:9e:e4:ed:c4:e0:b7:ab:0e:e4:e3:0a:c5:d1"
            id              = "tyeadon_3sc"
            key_name        = "tyeadon_3sc"
            key_name_prefix = ""
            key_pair_id     = "key-0021063e58120e82b"
            public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDEZ2a1o2OQCvScQipFvnQ7OrCxWRx7QwGa76BB6YJ9aex13AANeMXQQ3hLWdKvTA03N47x6CwbwBcFs532Oc0EFjYrFYmt3/ZrUW87OKC0LJz+i9Ap7HfMtJWAKL5HyFWTqL1ohsXrXftdotq54rfJK2xJ+hRsFVKXxd8FFVhPNAN5nV7oVf+7Q9/WnPwXcHJvPQCys6oiDCySk0a9P76sW1vSFghAIokgMsFYK9PE5gLP4wT3G13A+Z+VOZTLzUJHoYRnFK/QPI2P5fAf7vstVYwIdDhw9NwZF2j9bTabQsqJrxVUrqCX2A2xEzLgfbVQm4JG5LWxneLTkzX1vzHr"
            tags            = {}
            tags_all        = {}
        }
    }

Warning: Argument is deprecated

  on modules/bootstrap/main.tf line 6, in resource "aws_s3_bucket" "state_bucket":
   6: resource "aws_s3_bucket" "state_bucket" {

Use the aws_s3_bucket_versioning resource instead

(and 13 more similar warnings elsewhere)


Warning: Interpolation-only expressions are deprecated

  on modules/vpc/main.tf line 184, in resource "aws_instance" "bastion":
 184:   iam_instance_profile = "${aws_iam_instance_profile.bastion_profile.name}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

(and 2 more similar warnings elsewhere)


------------------------------------------------------------------------

This plan was saved to: terraform.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "terraform.tfplan"

Releasing state lock. This may take a few moments...
Terraform plan finished.
```